[{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/00P0P_3BVh3XiarRy_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%32%30%30+Winchester+Circle+Los+Gatos+CA+US","smoking_s":"false","subarea_s":"south bay","price_s":"$3556","sqft_s":"1123","postid_s":"5613253432","datetime_s":"2016-05-31 3:31pm 2016-05-31 3:31pm","bodytext_s":"Welcome to Aventino! CALL: show contact info x264 $3,556 - $4,091 . 2 Bed 2 Bath . 1123 sq ft * Unit D306 - Available Now * Unit A228 - Available Now * Unit B306 - Available Now Aventino : 200 Winchester Circle Los Gatos, CA 95032 Property Website: http://www.aventinoapts.com/ Want more information? http://unit-availability.com/lead/0k1168531960/1?extnId=5925042 DESCRIPTION Welcome home to your European Oasis. Wake to the soft sounds of a courtyard fountain, as little birds call you to rise and shine, head down to the lap pool for a swim and later on, host a Friday night movie night in our state of the art Cinema Room. Here at Aventino, the best things in life come together in one place. Amenities: Heated Pool Jacuzzi Play Structure Fitness Center Cyber Caf? Cinema Lounge Business Center Conference Room Aventino Services Dry Cleaning Service Package Tracking Active Building Monthly Social Events Easy Access To: Los Gatos Trail Down Town Los Gatos Los Gatos Creek County Dog Park Highways: 85, 17, 880, 280 30 Minutes from Santa Cruz Beach Down Town Campbell Vasona Park Please call for an appointment today! LEASE  TERMS 1-12 Months OFFICE  HOURS Monday 9:00am to 6:00pm    Tuesday 9:00am to 6:00pm    Wednesday 9:00am to 6:00pm    Thursday 9:00am to 6:00pm    Friday 9:00am to 6:00pm    Saturday 9:00am to 6:00pm    Sunday 9:00am to 6:00pm    CALL US TODAY! show contact info x264 Equal Housing Opportunity","cats_s":"true","street_address_s":"200 Winchester Circle","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613253432.html","category_s":"apts/housing for rent","bathroom_s":"2","available_s":"available may 31","title_s":"European Style 2x2 with Stellar Specials! Call for details.","neighborhood_s":"los gatos","dogs_s":"true","housetype_s":"apartment"},
{"wheelchair_s":"true","bedroom_s":"1","image_src_s":"http://images.craigslist.org/00B0B_i2YhKdLil61_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%35%30%31+Murphy+Ranch+Road+Milpitas+CA+US","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$2032","sqft_s":"776","postid_s":"5613241145","datetime_s":"2016-05-31 3:24pm 2016-05-31 3:24pm","bodytext_s":"Cerano Apartments 501 Murphy Ranch Road, Milpitas, CA, 95035 Want more info on this unit? See the link (below): http://fairfield-apts.com/7h699c Call Now: show contact info Brand New Luxury Apt Homes in Milpitas - Ready to Move In! Now open! The newest luxury apartments in Murphy Ranch of Milpitas: Cerano Apartment Homes. Now leasing studio, one-, two- and three-bedroom homes with a central garage! Features - High 9' ceilings with crown molding - Clean steel, Energy Star? appliances: gas range, microwave, icemaker refrigerator, dishwasher - Generous pantry with adjustable shelves - In-home washer dryer - Private patio or balcony with French door - Granite counter tops and choice of antique white or espresso cabinets - Kitchen island or breakfast bar Community Amenities - Clubhouse with eGame room, gourmet kitchen and dining room, billiards and TV lounge - Additional storage available - State-of-the-art fitness center with separate spin room - Six distinct courtyards with barbecue areas, Bocce ball, Zen garden and fireside lounge - Business center and WiFi caf? - Adjacent to Coyote Creek Trail and city park with playgrounds, basketball and tennis courts - Pets welcome! (breed restriction, no weight restriction) - Relaxing spa and pool with six-inch wading area - Controlled access, six-level garage with elevators Office Hours Mon, Tues, Thurs, Fri: 10am-6pm Wed: 11am-6pm Sat: 10am-5pm Sun: 12pm-5pm Pet Policy Deposit and Pet Rent: $250 deposit - $50/month dogs and $25/month for cats *Breed Restrictions apply. Photos on this ad may not reflect all floorplans. Advertised availability is subject to change without notice and cannot be guaranteed. Equal Housing Opportunity F3ZTuca2hu","cats_s":"true","street_address_s":"501 Murphy Ranch Road","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613241145.html","category_s":"apts/housing for rent","bathroom_s":"1","available_s":"available may 31","title_s":"***INCOME RESTRICTED*** ONE BEDROOM HOME AVAILABLE!! GET $500 OFF!!","neighborhood_s":"milpitas","dogs_s":"true","housetype_s":"apartment"},
{"bedroom_s":"6","image_src_s":"http://images.craigslist.org/00b0b_dzgSrnF8vrk_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%31%39%31%34%37+Loree+Ave+cupertino+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$6800","sqft_s":"33420","postid_s":"5613098526","datetime_s":"2016-05-31 1:58pm 2016-05-31 1:58pm","bodytext_s":"Contact info: OneRent | show contact info 6Bd/4Ba Single Family House 19147 Loree Ave, Cupertino, CA 95014 $6,800/mo KEY FEATURES Sq Footage: 3342 sqft. Bedrooms: 6 Beds Bathrooms: 4 Baths Parking: 3 Other Lease Duration: 1 Year Deposit: $6,800 Pets Policy: Cats & Dogs OK Laundry: In Unit Property Type: Single Family House DESCRIPTION Open, airy, freshly remodeled home in a cul-de-sac with spacious bedrooms and 4 full baths. This stunning home is in a prime location, walking distance to downtown Cupertino. Enjoy the beautiful backyard and renovated garage that can be used for work or play. RENTAL FEATURES Living room Dining room Walk-in closet Master bath Family room Pantry Office Range / Oven Refrigerator Dishwasher Microwave Garbage disposal Stainless steel appliances Balcony, Deck, or Patio Garden Heat: forced air Central A/C Ceiling fans Double pane / Storm windows Cable-ready High-speed internet Wired Hardwood floor Tile floor Granite countertop Fireplace Contact info: OneRent show contact info","cats_s":"true","street_address_s":"19147 Loree Ave","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613098526.html","category_s":"apts/housing for rent","bathroom_s":"4","available_s":"available may 31","title_s":"Amazing House with 6/4 ,pets OK","neighborhood_s":"cupertino","dogs_s":"true","housetype_s":"house"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00I0I_eumJlY739I5_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%33%33%33%33+cropley+court+san+jose%2C+CA+US","subarea_s":"south bay","laundry_s":"false","price_s":"$2780","sqft_s":"1228","postid_s":"5613240266","datetime_s":"2016-05-31 3:23pm 2016-05-31 3:23pm 2016-05-31 3:27pm","bodytext_s":"Very spacious 3 bedroom 2 bathroom single family house in North San Jose close to Milpitas, convenient location close to 680/880. Two car attached garage. Address: 3333 Cropley Court, San Jose, Ca 95132. Rent: $2780/mo., $3000 deposit, one year lease, tenants to pay all utilities. Contact: Jenny at show contact info (H), or show contact info (cell), or reply to this email, English or Chinese speaking.","street_address_s":"3333 cropley court","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613240266.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available jun 10","title_s":"3Bd2Ba Single Family House in North Valley","neighborhood_s":"san jose north","housetype_s":"house"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/00909_dpXrrLP2y9F_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+Country+Lane+San+Jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$2550","sqft_s":"1143","postid_s":"5602030766","datetime_s":"2016-05-24 10:19am 2016-05-24 10:19am 2016-05-31 3:09pm","bodytext_s":"Country Lane Apartments is the ideal location for excellent schools, convenience to local attractions, and many shopping and dining areas. Large rooms with spacious closets and a washer and dryer within the unit, makes this a perfect place for a home. With laminated, pergo floors, it reflects the sunlight to radiate the rooms, creating a bright and airy environment. The apartment also features central A/C and heating along with a private patio and kitchen breakfast bar to encompass the entity of this beautiful living complex. Community amenities include three sparkling, refreshing swimming pools, a gated parking structure, and fitness center. Beautiful landscaping lines the path towards this amazing apartment complex with a fresh rosy scent that fills the senses. Make this apartment yours today! Washer and Dryer in Unit Outstanding School System One of the most beautiful garden apartments in the area. Private with lots of light. Underground Gated Parking. Enjoy the luxury of having three sparkling pools, two bubbling whirlpool spas and an on-site fitness center. Pet policy: In general, we accept indoor neutered/spayed cats only with pet deposit of $500 and pet fee at $35 per month, but dogs are not accepted. However, service animals and emotional support animals are accepted in accordance with state and federal law. Application: $30 Application Fee for each Adults Deposit: $900 on Approved Credit Lease: 12 months We do not participate in the Section 8 Housing or Subsidized Programs. 4760 Country Lane, San Jose, CA 95129 Call show contact info to schedule a showing. Walk-ins are welcome (If no one is there to answer your call, please leave a message and we will get back to you as soon as possible)","street_address_s":"Country Lane","page_url_s":"http://sfbay.craigslist.org/sby/apa/5602030766.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available may 31","title_s":"double master bedroom, Pergo floors, Granite counter tops","neighborhood_s":"san jose west","housetype_s":"apartment"},
{"wheelchair_s":"true","bedroom_s":"1","image_src_s":"http://images.craigslist.org/00H0H_hh5irPrDXC_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%33%35%35+Kiely+Blvd+San+Jose+CA+US","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$2419","sqft_s":"654","postid_s":"5613222346","datetime_s":"2016-05-31 3:12pm 2016-05-31 3:12pm","bodytext_s":"Unwind in Your New Home Where Luxury Meets Comfort Call Now: show contact info Park Kiely Apartments 355 Kiely Blvd., San Jose, CA, 95129 Follow This Link for More Information: http://apartments.greystar.com/6h78q8 Upscale, Expansive Living at Park Kiely When you live at the apartments of Park Kiely, you'll truly have it all. Newly upgraded studio, one, two and three-bedroom residences, filled with features and finishes to make every day brighter. An incredible abundance of amenities, from sports and fitness to relaxation and business. Best of all, our distinctive community offers a natural setting -- yet it's perfectly situated to help you take advantage of the Bay Area. Enjoy the possibilities of every day, right here at Park Kiely. Features - Private Patio or Balcony - Wall Unit Air Conditioning* - Floor to Ceiling Windows - Garbage Disposal - Full Size Electric Stove Top and Oven - Separate Dining Room - Centralized Air Conditioning and Heat* Community Amenities - Indoor Play Area - Courtesy patrol - Immediate Access to the 280 and 880 - Theatre Room - 4 Swimming Pools - Outdoor Playground - Buses to Light Rail - Fitness Center with TV Monitors and Free Weights - Outdoor BBQ Grill - 2 Soothing Spas - Pet Friendly - Sports Arena including Jogging Track, Tennis, Basketball - Gated Community - Sand Volley Ball Court - Game Room - Pool-Side Cabanas with Gas Grills - Picnic Areas - Dog Park - Internet Caf? with WiFi Pet Policy Please contact us for more details Office Hours Monday-Saturday: 9 am - 6 pm Sunday 11am -5pm Equal Housing Opportunity FuMUg7V173N4","cats_s":"true","street_address_s":"355 Kiely Blvd","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613222346.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available may 31","title_s":"Sand Volley Ball Court, Picnic Areas, Buses to Light Rail, Game Room","neighborhood_s":"san jose west","dogs_s":"true","housetype_s":"apartment"},
{"bedroom_s":"1","image_src_s":"http://images.craigslist.org/00u0u_8mzKZ3mLfkP_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+Tully+Rd+at+Senter+Rd+San+Jose+CA+US","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$750","sqft_s":"120","postid_s":"5600933626","datetime_s":"2016-05-23 3:50pm 2016-05-23 3:50pm 2016-05-31 3:17pm","bodytext_s":"One nice, sunny, clean, single private bed room is available for rent. The place has a bonus sun room in a friendly and respectful environment. It has a large yard spaces in a quiet and safe neighborhood of San Jose. Looking for a professional or a student that is mature, responsible, peaceful, communicative, respectful, clean and willing to share light house chores. We keep the house in tidy, clean, neat condition and looking for someone who has similar qualities to share a delightful living space. The house has a vege / vegan kitchen so we will not be consuming meat or seafood at the property. You do not need to be vegetarian to live here, but keep in mind that inside this house it's pure vege food only. The house is also a green household. I compost, planting organic fruits, recycle with environmentally safe mindset. The house is usually quiet after 10pm, and people are respectful to each other and our surroundings.Washer + dryer are in exterior laundry room. There is extra storage space and a lot of other features, making this a very comfortable and cozy space: large, sunny yard & Organic garden, hard wood floors The room ($750 monthly rent with $70 utility / month, deposit is one month rent): wooden floor, one closet, large window with plenty of light throughout day time. Room can be unfurnished or furnished with twin-size bed, closet, desk, chair, and standing lamp. The utility will cover: PG&E (Electricity + Gas), Water, Garbage, Comcast High Speed Cable Internet. Sorry but there's no pets allowed, as much as I love animals but I have tenants who are allergic to cats / dogs, No Smoking, No Alcohol / Drugs Abuse, No Overnight Stay (with permission is Ok), No Party Animals, No Drama Queen, No MESSY People, No Dishonesty, and Absolutely No Illegal Acts. Credit/criminal check required to secure room, 1st month's rent due upon move-in. Minimal is 6 month rental. Location of this house is close to SJSU and downtown San Jose (2~3miles). Very close to grocery stores, eating joints, mall, parks and VTA bus stops. Within 3 miles we have: Valley Health Center, Costco, Cyote Creek Trail, Park and Recreation, San Jose Public Library (Tully Branch), Kelley's Park (Japanese Friendship Garden), The Plant Shopping Center: shops + restaurants, EastRidge Mall, 101 Freeway, San Jose Giants Minor League Baseball Stadium, San Jose Sharks Ice Hockey Stadium, SJSU Spartan Stadium, 87 Freeway, San Jose State University, San Jose Downtown Within 4~7 miles: Santana Row, San Jose Japan Town, HP Pavilion at San Jose, San Jose Airport, Santa Clara University, Sprouts Farmers Market, Trader Joe's, WholeFoods","street_address_s":"Tully Rd at Senter Rd","page_url_s":"http://sfbay.craigslist.org/sby/apa/5600933626.html","category_s":"apts/housing for rent","bathroom_s":"Other","parking_s":"true","available_s":"available may 23","title_s":"Nice and Clean Room for Rent close to San Jose Downtown","furnished_s":"true","neighborhood_s":"san jose south","housetype_s":"house"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/00N0N_3a4ztoH3xom_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%31%39%31%31+California+Street+Mountain+View+CA+US","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$2695","sqft_s":"1000","postid_s":"5578349513","datetime_s":"2016-05-09 3:59pm 2016-05-09 3:59pm 2016-05-31 3:17pm","bodytext_s":"Property Address 1911 California Street | Mountain View, CA 94040 Offered By Cal Bay Property Management This is an extremely spacious unit (1,000 S.F.) with 2 bedrooms and 2 bathrooms. Wall to wall hardwood laminate flooring throughout living area - Dishwasher- Air Conditioning- Central Heating System- Large Private Balcony with new dual paned sliding door- All new dual paned vinyl windows- Huge private walk in storage room accessed through carport parking space - Secure building with Intercom/Entry System Community Highlights: Swimming Pool Area - On-Site Laundry facilities. - Reserved covered parking (1 space). 1 uncovered space also included with each unit. - Mature Landscaping provides shade and privacy - Prime Mountain View location- Owner pays water, water heating, garbage, sewer Up to two cats are allowed per apartment with an additional pet rent of $75/pet and $400 refundable pet deposit per pet. To schedule a viewing please contact Maria, show contact info Application Fee: $40.00 Security Deposit: $1,000.00","cats_s":"true","street_address_s":"1911 California Street","page_url_s":"http://sfbay.craigslist.org/sby/apa/5578349513.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available may 05","title_s":"Renovated and value priced for June move in!","neighborhood_s":"mountain view","housetype_s":"apartment"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/00c0c_jpeaa3eNRmg_600x450.jpg","google_maps_link_s":"https://maps.google.com/maps/preview/@37.405600,-122.077500,16z","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$2450","postid_s":"5613237718","datetime_s":"2016-05-31 3:21pm 2016-05-31 3:21pm 2016-05-31 3:31pm","bodytext_s":"Landscape front common area with Pool and onsite laundry room. Quiet and Seren .. 2bedroom spacious lg closet 1 bathroom Entry coat closet Covered parking with lockable storage. Excellent ownership and management ***We offer one year lease month/month after that or another lease if you like ***no pets ***no smoking 2k Security Deposit Need ***verifiable income, w/credit and housing reference Please leave name and number and some detail with reply","street_address_s":"","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613237718.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available may 31","title_s":"Quite and Serene-XL loc. Between t/ 2 Google campus","neighborhood_s":"mountain view","housetype_s":"apartment"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00k0k_5Tj4bWujx5Q_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%37%36%39+Gantry+Way+Mountain+View+CA+US","smoking_s":"false","subarea_s":"south bay","price_s":"$5500","sqft_s":"1304","postid_s":"5613236285","datetime_s":"2016-05-31 3:20pm 2016-05-31 3:20pm","bodytext_s":"Beautifully Remodeled Cuesta Park Neighborhood Home! Property Address 769 Gantry Way | Mountain View, CA 94040 Available: 06/01/2016 Offered By GS Property Management, Inc.  |  show contact info Description Three bedroom, one bath with bonus room! This home has been lovingly updated with a new kitchen, including beautiful new appliances, cabinets, counters and tile backsplash! One car garage with attached laundry room! Plenty of storage in the garage and side yard. New bamboo hardwood floors throughout! New blinds and light fixtures! Lovely new landscaped property with front and back patios! No smoking, no pets! Property Listing **Please note: Golden State Property Management will never ask for funds prior to an application approval. We require that you view the property before submitting an application and will always have a manager meet at the property for showings. ***Appointments are not scheduled over email Please reference the property address when making an appointment show contact info *** Details Beds/Baths: 3BD/1.0BA Square Feet: 1,304 Rental Terms Rent: $5,500.00 Available: 06/01/2016 Application Fee: $35.00 Security Deposit: $5,500.00","street_address_s":"769 Gantry Way","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613236285.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available may 31","title_s":"Beautifully Remodeled Cuesta Park Neighborhood Home!","neighborhood_s":"mountain view","housetype_s":"house"},
{"bedroom_s":"1","image_src_s":"http://images.craigslist.org/00k0k_j2GX0punY89_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%31%39%30+Ryland+St%2E+San+Jose+CA+US","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$2510","sqft_s":"950","postid_s":"5613234801","datetime_s":"2016-05-31 3:20pm 2016-05-31 3:20pm","bodytext_s":"Fountain Plaza http://legacyfountainplaza.com/su/ktpg Floor Plan: Valencia Sq Feet: 859 - 1303 Rent: $2510.00 - $4285.00 Deposit: $700.00 - $700.00 Bed/Bath: 1/1 Community Amenities Resort-Style Pool Conference Room 3rd Floor Covered Parking Relaxing Spa Complete Fitness Center We Love Pets! 1st Floor 2nd Floor Resident Clubhouse Nearby Public Transportation Garage Parking* Minutes from Downtown San Jose Controlled-Access Community Pool View Yard Location Courtyard View Top Floor Stainless Additional Storage Gated Access Community Close to Hiking and Biking Trail Furnished Units Available* Close to Shopping and Fine Dining Easy Freeway Access to 87, 280, 101 & 880 Flooring Upgrade BMR Bonus Size Expanded Floor Plan Reduced Size Transit Work Space Bldg 6 Premium Business Center Contact Us Fountain Plaza Address:190 Ryland St., San Jose, CA 95110 Phone: show contact info Online:http://legacyfountainplaza.com/su/ktpg Office Hours: Mon: 9:00am - 6:00pm Tue: 9:00am - 6:00pm Wed: 9:00am - 6:00pm Thu: 9:00am - 6:00pm Fri: 9:00am - 6:00pm Sat: 9:00am - 6:00pm Sun: 9:00am - 6:00pm EQUAL HOUSING OPPORTUNITY Fountain Plaza, Dog, CA, Apartments to rent, Cat, San Jose","street_address_s":"190 Ryland St.","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613234801.html","category_s":"apts/housing for rent","bathroom_s":"1.5","parking_s":"true","available_s":"available jul 10","title_s":"Our Lofts Have High Ceilings, Kitchen Islands, Washer/Dryer and More!","neighborhood_s":"san jose downtown","housetype_s":"apartment"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00606_8E5nsLdc0Sy_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%31%32%31%31+Carnelian+Dr+san+jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$3000","sqft_s":"1034","postid_s":"5613179994","datetime_s":"2016-05-31 2:45pm 2016-05-31 2:45pm","bodytext_s":"Contact info: OneRent | show contact info Excellent 3/1.5 Home in Perfect Central Location Carnelian Dr, San Jose, CA 95122 $3,000/mo KEY FEATURES Sq Footage: 1034 sqft. Bedrooms: 3 Beds Bathrooms: 2 Baths Parking: 4+ Garage Lease Duration: 1 Year Deposit: $3,000 Pets Policy: No Pets Allowed Laundry: In Unit Property Type: Single Family House DESCRIPTION Excellent house located in the heart of San Jose offers living space of 1,034 sqft. Features 3 bedrooms and 1.5 baths. It has an open and flowing floor plan, a cozy fire place, nice hardwood floors throughout, has central heating/cooling, and a formal dining place great for entertainers' delight. This single family home comes with a gourmet kitchen as well. Bright looking with granite countertops plus stainless steel appliances. Also equipped with washer and dryer, refrigerator, and microwave. Close to Santee Elementary School. Just a short walk to shopping centers, fine restaurants and freeways. Off street parking, 1 car attached garage, and a fenced backyard. RENTAL FEATURES Range / Oven Refrigerator Dishwasher Microwave Stainless steel appliances Balcony, Deck, or Patio Fenced yard Heat: forced air Cable-ready High-speed internet Hardwood floor Granite countertop Fireplace COMMUNITY FEATURES Off-street parking Garage - Attached ADDITIONAL LINKS Website: https://www.onerent.co/rentals/ca/san-jose/1211-carnelian-dr/56ba8a0df7b6800e004918fe Contact info: OneRent show contact info","street_address_s":"1211 Carnelian Dr","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613179994.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available apr 29","title_s":"Excellent 3/1.5 Home in Perfect Central Location","neighborhood_s":"san jose","housetype_s":"house"},
{"bedroom_s":"4","image_src_s":"http://images.craigslist.org/00w0w_biDTkVGlIHX_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+N+%32%31st+Street+at+Hedding+St+San+Jose+CA+US","subarea_s":"south bay","laundry_s":"false","price_s":"$3500","sqft_s":"1360","postid_s":"5613253130","datetime_s":"2016-05-31 3:31pm 2016-05-31 3:31pm","bodytext_s":"Home available now NO APPLICATION FEE CALL: show contact info or respond to this ad and we will get back to you within 24 hours, M-F Ready for move in! Bed/s: 4 Bath/s: 2 6-12month lease required very good condition/partially remodeled $3500 monthly rent $3500 deposit ALL PAYMENTS MUST BE IN CERTIFIED FUNDS! Ready for move-in! Utilities: tenant pays all In A Great location, nice neighborhood, easy access to freeway 101& 880 Requirements: 1.) A copy of valid Photo ID/Driver's License: so that we can assure the property owner that the person applying for the property is indeed the person moving in, and authorization for us to verify information given on the application and to order a credit check if needed. 2.) A copy of Bank Statement (last 2 months) and a copy of Pay stubs (last 2 pay periods): in order to verify that there is adequate income to make rental payments. 3.) Credit History - in order to verify that the prospective tenant has demonstrated fiscal responsibility. We look for payments that are made on time, and the credit responsibilities are in line with income. 4.) A completed application form - in order to obtain information such as contact number, previous landlord, emergency contact person, etc. ***no application fee*** ***no pets are allowed at this property***","street_address_s":"N 21st Street at Hedding St","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613253130.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available may 25","title_s":"Large 4-Bedroom Home Available","neighborhood_s":"san jose west","housetype_s":"house"},
{"wheelchair_s":"true","bedroom_s":"0","image_src_s":"http://images.craigslist.org/00L0L_4lTlJPQJVa_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%31%31%30%31+North+Fair+Oaks+Avenue+Sunnyvale+CA+US","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$2828","sqft_s":"569","postid_s":"5613232697","datetime_s":"2016-05-31 3:18pm 2016-05-31 3:18pm","bodytext_s":"Anton 1101 http://anton1101.com/su/6k4l With an array of studio, one- and two-bedroom layouts to choose from, our residences provide you with the space you need and the comfort you deserve. Inside your home, you'll find every detail was carefully considered to create a sophisticated living experience. The well-appointed floor plans and thoughtful amenities coupled with the lush surroundings and the exquisite Sunnyvale vibe will inspire you year round. Floor Plan: Chic Sq Feet: 569 Rent: $2828.00 - $3428.00 Deposit: $600.00 - $600.00 Bed/Bath: 0/1 Floor Plan: Allure Sq Feet: 702 Rent: $3132.00 - $3732.00 Deposit: $600.00 - $600.00 Bed/Bath: 1/1 Floor Plan: Serene Sq Feet: 972 Rent: $3639.00 - $4364.00 Deposit: $700.00 - $700.00 Bed/Bath: 2/2 Floor Plan: Novel Sq Feet: 1240 Rent: $4238.00 - $4838.00 Deposit: $700.00 - $700.00 Bed/Bath: 2/2 Community Amenities We Love Pets!* Professional On-Site Management Elevator Access Extra Storage Available 1st Floor Controlled-Access Community Community Barbecues Resident Lounge with Flat-Screen TVs Fire Pit Lounge Area On-Site Bicycle Storage Areas Corner Unit 24-Hour Indoor/Outdoor Wellness Center with Cardio Theater Adjacent to VTA Light Rail Easy Access to 101 and 237 Freeways Dog Run and Dog Washing Station Resort-Inspired Pool and Spa with Cabanas Direct Trail to New Seven Seas Park Covered Underground Garage Parking Three Train Stops to Levi's Stadium Steps to Grocery Store, Restaurants and Peet's Coffee Outdoor Kitchen and Entertainment Center Gaming Center Social Hub with Cutting Edge Technology Brand New Construction Property VIP Concierge Services including Electronic Package Notification iCafe with Coffee Bar Top Floor Pool/Courtyard View VAULTED CEILINGS Landscape Contact Us Anton 1101 Address:1101 North Fair Oaks Avenue, Sunnyvale, CA 94089 Phone: show contact info Online:http://anton1101.com/su/6k4l Office Hours: Mon: 9:00am - 6:00pm Tue: 9:00am - 6:00pm Wed: 9:00am - 6:00pm Thu: 9:00am - 6:00pm Fri: 9:00am - 6:00pm Sat: 9:00am - 6:00pm Sun: 12:00pm - 4:00pm ADA ACCESSIBLE EQUAL HOUSING OPPORTUNITY","cats_s":"true","street_address_s":"1101 North Fair Oaks Avenue","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613232697.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available jun 10","title_s":"Homes available less than a year old!! **Jr. one bedroom, one bedroom,","neighborhood_s":"sunnyvale","dogs_s":"true","housetype_s":"apartment"},
{"wheelchair_s":"true","bedroom_s":"2","image_src_s":"http://images.craigslist.org/00m0m_1Fr7XJ2Ddk0_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%31%39%37%30%30+Vallco+Parkway+Suite+%31%38%30+Cupertino+CA+US","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$3796","sqft_s":"1381","postid_s":"5613204269","datetime_s":"2016-05-31 3:00pm 2016-05-31 3:00pm","bodytext_s":"Craigslist Ad CALL TO SCHEDULE FOR A TOUR Live It Up With Remarkable Designer Finishes â€¢ Oversized Windows with Abundant Natural Light â€¢ Walk-In Closets â€¢ Private Balconies â€¢ European style Kitchen with Gas Ranges â€¢ Stainless Steel Appliances â€¢ Italian Tile Floor -- Kitchen and Bath â€¢ Hardwood-Style Floor â€¢ Designer Quartz Countertops â€¢ Marble Bathtub Surround â€¢ Pets Welcome â€¢ In-Home Washer and Dryer â€¢ Huge*2 bedroom / 2 bath 1281sq.ft. -- 1476 sq.ft. â€¢ Huge* 3 bedroom / 2 bath 1455 sq.ft. -- 1764 sq.ft. Community Amenities For Everyone â€¢ Concierge Services â€¢ Cupertino School District â€¢ Indoor Lounge with Fireplace and Outdoor Fire Pit â€¢ Pet Park / Pet Friendly Community â€¢ Private Subterranean Parking â€¢ Private Cinema â€¢ Game Room â€¢ Business Lounge â€¢ Fitness / Training Room â€¢ Training / Multi-Purpose Room â€¢ Community Area WI-FI â€¢ Electric Car Charging Stations Available â€¢ Extra Parking Available â€¢ Dedicated Pet Area 19700 Vallco Parkway Suite 180., CUPERTINO, CA 95014 Office Hours: Monday-Friday 9am-6pm, Saturday-Sunday 10am-6pm Ph. show contact info Email: nineteen800@ legacy partners .com #354-PRICING AND AVAILABILITY ARE ALWAYS SUBJECT TO CHANGE","cats_s":"true","street_address_s":"19700 Vallco Parkway Suite 180","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613204269.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available jul 19","title_s":"3rd floor - Facing inside court yard area. See you soon!","neighborhood_s":"cupertino","dogs_s":"true","housetype_s":"apartment"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/00O0O_KtTVAfbdUj_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+Saratoga+Ave+San+Jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$2400","sqft_s":"1040","postid_s":"5613221273","datetime_s":"2016-05-31 3:11pm 2016-05-31 3:11pm","bodytext_s":"Available Soon: Saratoga Loire Apartments feature an English style exterior design surrounded by lovely roses and mature bushes. With its plush landscaping, residents are able to relax from their stressful lives by resting in our spacious courtyard or swimming in our sparkling pool. Saratoga Loire is also located in an excellent location with close proximity to shopping centers such as Westgate Mall, Westfield Valley Fair Mall, Santana Row and schools such as Country Lane Elementary School, Mooreland Middle School and Prospect High School. 2 beds and 2 baths Unique Features: Pergo Floor Granite Kitchen Counter Tops Dining Area Spacious Patio Top Floor Covered parking Swimming Pool Community Laundry Facility (Coin Operated) Personal Picnic Area Beautiful green landscaping Delightful Rose Garden Peaceful Interior Courtyard Utilities: Garbage, sewage and water are included in rent tenants pays for electricity, cable, internet, etc Pet Policy: In general, we accept indoor neutered/spayed cats only with pet deposit ($500) and pet fee ($35 per month), but dogs are not accepted. However, service animals and emotional support animals are accepted in accordance with state and federal laws Application: $30 Application Fee for each Adults Deposit: $1200 on Approved Credit Lease: 12 months We do not participate in the Section 8 Housing or Subsidized Programs. Leasing office address: 4760 county Lane, San Jose, CA.95129 For an appointment call show contact info walk-ins are welcome office hours are Monday-Saturday 9AM-6PM.","street_address_s":"Saratoga Ave","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613221273.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available may 31","title_s":"Gated 2x2 Apartment, Pergo & Granite, walking distance to Country Lane","neighborhood_s":"san jose west","housetype_s":"apartment"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/01212_liLaKjmAO7R_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%31%38%30+Locksunart+Way+Sunnyvale+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$3050","sqft_s":"1000","postid_s":"5613231846","datetime_s":"2016-05-31 3:18pm 2016-05-31 3:18pm","bodytext_s":"Contact info: Malena Mendez | Magnolia Place | show contact info Be the first to live in the Brand New Fully Renovated Apartment Home!!! 180 Locksunart Way 1ST FLOOR, Sunnyvale, CA 94087 $3050/mo KEY FEATURES Sq Footage: 1000 sqft. Bedrooms: 2 Beds Bathrooms: 1 Bath Parking: 2 Carport Lease Duration: 1 Year (See Details Below) Deposit: $500 Pets Policy: No Pets Allowed Laundry: Shared Floor: 1st floor Property Type: Apartment DESCRIPTION -------------------------------------------------------------------------------- Welcome to Magnolia Place Apartments- We are located in the Cupertino School District! I currently have an opening for a Fully Renovated, 1st Floor Unit. Rent $3050 Deposit $500 on approved credit $35 Application Fee for anyone over the age of 18 Sorry No Pets! This unit is over 1000 sqft and has a large patio area. Be the first to use the Brand New Stainless Steel Appliances in our grand kitchen. Appliances include Large Refrigerator, Dishwasher, Vented Microwave, and Smooth Top Cook Range. Our kitchens have New Cabinets with Granite Countertops with all new Lighting Fixtures throughout. Our Luxury Espresso Vanity Bathroom sets will not disappoint! This 2 bedroom1 bathroom unit offers: -New Carpet Installation -Crown Molding -New Paint -New Royal Valance Vertical Blinds -Assigned Parking - Shared Pool - 5 Laundry Rooms on site - Management onsite - Maintenance If you'd like to set up a time to see this Beautiful Apartment Home for yourself please call show contact info This unit is ready for move in, so please call today! We are located in the Cupertino School District! Thank you for your interest. RENTAL FEATURES -------------------------------------------------------------------------------- ?Living room ?Dining room ?Storage space ?Range / Oven ?Refrigerator ?Dishwasher ?Microwave ?Garbage disposal ?Stainless steel appliances ?Freezer ?Balcony, Deck, or Patio ?Heat: forced air ?Ceiling fans ?Double pane / Storm windows ?Cable-ready ?High-speed internet ?Hardwood floor ?Granite countertop COMMUNITY FEATURES -------------------------------------------------------------------------------- ?Shared pool ?On-street parking LEASE TERMS -------------------------------------------------------------------------------- 12 months Contact info: Malena Mendez Magnolia Place show contact info","street_address_s":"180 Locksunart Way","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613231846.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available jul 08","title_s":"Cupertino School District ~ Magnolia Place","neighborhood_s":"sunnyvale","housetype_s":"apartment"},
{"bedroom_s":"0","image_src_s":"http://images.craigslist.org/00K0K_hVy7RKs2lUa_600x450.jpg","google_maps_link_s":"https://maps.google.com/maps/preview/@37.241700,-121.955400,16z","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$3587","sqft_s":"639","postid_s":"5613230335","datetime_s":"2016-05-31 3:17pm 2016-05-31 3:17pm","bodytext_s":"Vivere 137 Riviera Dr Los Gatos, ca 95032 Property Website: http://www.viverelosgatos.com  1A ? 1  bed / 1 bath / 639 sq ft / $3,587 - $3,809 Vivere - Contemporary living in los gatos Surround yourself with the best Los Gatos has to offer at Vivere Apartments. Our brand new flats and townhomes feature gourmet kitchens, wood floors, washers and dryers, walk-in closets and private outdoor space. Your new home is steps from the swimming pool and spa, outdoor lounge with kitchen, TV, fireplace and grilling stations. A community room with billiards and fitness center round out the private onsite amenities. We are a pet-friendly community with special K-9 Turf Zones. We look forward to helping you find the perfect place to call home! Please contact the Leasing Center at show contact info for more details. Property Amenities: * Outdoor entertainment lounge with kitchen, TV, fireplace & grilling stations * Smoke-free units available * Free WiFi in common areas * Refreshing pool with spa * Clubhouse with billiards * Convenient to Highways 9, 17, 85, & I-280 and to the Santa Cruz Area * Adjacent to Los Gatos Creek trail * Relaxing sun deck * Assigned Parking Available * State-of-the-art fitness center * Resident functions & community events * Walking distance to vibrant downtown Los Gatos * Pet-friendly -- 2 K-9 Turf Zones Lease Terms: 12 months. Floorplan specifications and prices are subject to change without notice. Parking: Assigned Parking Available Pet Policy: Cats and Dogs are allowed. Breed and size restrictions may apply. Call for details. Management Company: Woodmont Real Estate Services* Want more information? http://unit-availability.com/lead/200700172304/1?extnId=5925170 Call Us Today! show contact info x119 Equal Housing Opportunity","cats_s":"true","street_address_s":"","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613230335.html","category_s":"apts/housing for rent","bathroom_s":"Other","parking_s":"true","available_s":"available may 31","title_s":"Los Gatos' Best. Walk to Downtown.","neighborhood_s":"los gatos","dogs_s":"true","housetype_s":"apartment"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/00U0U_itbpb2XD1Al_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%31%39%30+Ryland+St%2E+San+Jose+CA+US","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$2935","sqft_s":"1130","postid_s":"5613229150","datetime_s":"2016-05-31 3:16pm 2016-05-31 3:16pm","bodytext_s":"Fountain Plaza http://legacyfountainplaza.com/su/5zvq Floor Plan: Catalina Sq Feet: 1131 - 1278 Rent: $2935.00 - $5070.00 Deposit: $700.00 - $700.00 Bed/Bath: 2/2 Community Amenities Resort-Style Pool Conference Room 3rd Floor Covered Parking Relaxing Spa Complete Fitness Center We Love Pets! 1st Floor 2nd Floor Resident Clubhouse Nearby Public Transportation Garage Parking* Minutes from Downtown San Jose Controlled-Access Community Pool View Yard Location Courtyard View Top Floor Stainless Additional Storage Gated Access Community Close to Hiking and Biking Trail Furnished Units Available* Close to Shopping and Fine Dining Easy Freeway Access to 87, 280, 101 & 880 Flooring Upgrade BMR Bonus Size Expanded Floor Plan Reduced Size Transit Work Space Bldg 6 Premium Business Center Contact Us Fountain Plaza Address:190 Ryland St., San Jose, CA 95110 Phone: show contact info Online:http://legacyfountainplaza.com/su/5zvq Office Hours: Mon: 9:00am - 6:00pm Tue: 9:00am - 6:00pm Wed: 9:00am - 6:00pm Thu: 9:00am - 6:00pm Fri: 9:00am - 6:00pm Sat: 9:00am - 6:00pm Sun: 9:00am - 6:00pm EQUAL HOUSING OPPORTUNITY CA, Cat, Fountain Plaza, Dog, Apartments to rent, San Jose","street_address_s":"190 Ryland St.","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613229150.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available jul 08","title_s":"Beautiful Catalina Two Bedroom Ready for July!","neighborhood_s":"san jose downtown","housetype_s":"apartment"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00808_dtFL1nXQPFu_600x450.jpg","google_maps_link_s":"","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$3200","sqft_s":"1450","postid_s":"5613226117","datetime_s":"2016-05-31 3:14pm 2016-05-31 3:14pm","bodytext_s":"We are renting out our 3 bed/ 3 bath townhouse in Milpitas. The house is located in a very nice community and still in newly built condition. Comes with a 2 car attached garage. You can walk to light rail station, great mall (about ten mins walk). You are very close to most of the freeways and many offices!! You are also very closely located to the BART station coming up near Great Mall! Perfect spot to avoid traffic these days!! The house is available for occupancy starting July 4. Looking for responsible tenants that will keep our home in excellent condition. This is a multi level townhome with a bed and bath located in level 1. two other bedrooms and bathrooms are located in level 2. Perfect for privacy. The community comes with a pool open to residents . This is a very decent neighborhood mostly occupied by young families. P.S - No pets please. This is a multi level residence and not wheelchair accessible. Rent not negotiable.","street_address_s":"","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613226117.html","category_s":"apts/housing for rent","bathroom_s":"3","parking_s":"true","available_s":"available jul 04","title_s":"3 bed/ 3 bath townhouse - walk to lightrail / great mall!!","neighborhood_s":"milpitas","housetype_s":"townhouse"},
{"bedroom_s":"1","image_src_s":"http://images.craigslist.org/00j0j_ahPvI1KZJrC_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%32%30%38%30%30+Homestead+Rd+Cupertino+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$2911","sqft_s":"795","postid_s":"5613225849","datetime_s":"2016-05-31 3:14pm 2016-05-31 3:14pm","bodytext_s":"The Markham Apartments 20800 Homestead Rd Cupertino, ca 95014 Property Website: http://www.prometheusreg.com/san-francisco-properties/the-markham  Style 1 ? 1  bed / 1 bath / 795 sq ft / $2,791 - $4,588 Your adventure starts here--welcome to the Markham apartments in Cupertino. The garden style community at the Markham Apartments in Cupertino is flush with verdant landscaping and mature trees--an ideal backdrop for a wide range of exploits. Located in the heart of Silicon Valley, The Markham has easy access to parks, shopping, over a hundred choice restaurants and all the big tech--not to mention an excellent school district for the next generation of big thinkers.Custom made for living life to the fullest, the only thing the Markham apartments in Cupertino are lacking, is your personal touch. Property Amenities: * Pool * Business Center * Fitness Center * Cinema Lounge * Clubhouse * Never far from facebook. Lease Terms: We offer 1-12 month lease terms! Parking: Type - Covered Lot Apartment homes will receive a garage or parking permit depending on floor plan. Open carport parking is available for apartments with permits. Uncovered parking spaces are available for homes with a second car without parking permit or guests. Pet Policy: Cats and Dogs are allowed. We champion an all-inclusive, Friends With Paws Program. No more weight limits, height restrictions or Best in Show hoops and hurdles. We'll greet your four-legged confidante as a distinguished guest with a Welcome Kit that includes tasty treats and toys to help your pal feel right at home. Our staff can even help the two of you find suitable pet grooming and daycare services when you need them. *For the pooches breed restrictions do apply. Two pet maximum per home. Office Hours: Monday:   9:00am to 6:00pm   Tuesday:   9:00am to 6:00pm   Wednesday:   9:00am to 6:00pm   Thursday:   9:00am to 6:00pm   Friday:   9:00am to 6:00pm   Saturday:   9:00am to 6:00pm   Sunday:   9:00am to 6:00pm   Management Company: Prometheus Real Estate Group, Inc.* Want more information? http://unit-availability.com/lead/1008e0122129/1?extnId=5925194 Call Us Today! show contact info x291 Equal Housing Opportunity","cats_s":"true","street_address_s":"20800 Homestead Rd","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613225849.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available may 31","title_s":"Gorgeous 1x1 with Amazing Open Kitchen! Ask Us How to Get $1000 Off!","neighborhood_s":"cupertino","dogs_s":"true","housetype_s":"apartment"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00f0f_epGhLebyf2l_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%36%31%36+Los+Padres+Blvd+Santa+Clara+CA+US","smoking_s":"false","subarea_s":"south bay","laundry_s":"false","price_s":"$3695","sqft_s":"1543","postid_s":"5613225608","datetime_s":"2016-05-31 3:14pm 2016-05-31 3:14pm","bodytext_s":"Remodeled Santa Clara Home! Property Address 616 Los Padres Boulevard | Santa Clara, CA 95050 Available: 07/01/2016 Offered By GS Property Management, Inc.  |  show contact info Description Charming 3 bedroom 2 bath single family home just off Forbes and San Tomas Expressway with 1,543 square feet of living space. Updated kitchen offers granite counter tops, stainless steel refrigerator, gas range, microwave hood, and dishwasher. Dining area off kitchen. Forced heat, hardwood floors, one car attached garage, washer/dryer hookups, and fenced yard. Minutes from Henry Schmidt Park, Pruneridge Golf Club, Westwood Elementary School, Live Oak Academy, and Haman Elementary. **Please note: Golden State Property Management will never ask for funds prior to an application approval. We require that you view the property before submitting an application and will always have a manager meet at the property for showings. ***Appointments are not scheduled over email Please reference the property address when making an appointment show contact info *** Amenities Granite Counters in Kitchen Gas Range Dishwasher Over Range Microwave Hardwood Floors Throughout Tiled Floors In Family Room Double Pane Windows Central Heating Mirrored Closet Doors Details Beds/Baths: 3BD/2.0BA Square Feet: 1,543 Rental Terms Rent: $3,695.00 Available: 07/01/2016 Application Fee: $35.00 Security Deposit: $3,695.00","street_address_s":"616 Los Padres Blvd","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613225608.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available may 31","title_s":"Remodeled Santa Clara Home!","neighborhood_s":"santa clara","housetype_s":"house"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/00606_65KH9Yx1PrU_600x450.jpg","google_maps_link_s":"","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$2175","sqft_s":"874","postid_s":"5613225417","datetime_s":"2016-05-31 3:14pm 2016-05-31 3:14pm","bodytext_s":"Almaden House - Two Bedroom/1 Bath Rent............. $2,175 a month Deposit........ $900 Bedrooms.... 2 bedrooms Bathrooms... 1.0 bathrooms Sq. Feet....... 874 2 bedrooms and 1 bathroom Almaden House offers 1- and 2-bedroom apartments with spacious floor plans. The community is well maintained and located off Almaden Expressway in sunny South San Jose. The property has a beautiful sparkling pool with two onsite laundry facilities. We are just minutes away from 85,87,101 and 280 Highways , Oakridge Shopping Mall, Capitol Expressway Auto Mall, 24 Hour Fitness and San Jose International Airport. Call or stop by today to take a look! Contact us at show contact info Or visit our website at: http://www.almadenhouseapts.com http://www.almadenhouseapts.com Please telephone us at: show contact info","street_address_s":"","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613225417.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available may 31","title_s":"Great 2 bedroom-Special pricing $2,175 contact us now to reserve","neighborhood_s":"san jose south","housetype_s":"apartment"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/00505_27PAJpRwUga_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%31%36%33+Superior+Drive+Campbell+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$2575","postid_s":"5609720585","datetime_s":"2016-05-29 10:13am 2016-05-29 10:13am 2016-05-31 3:26pm","bodytext_s":"OPEN HOUSE: FRIDAY, SATURDAY AND SUNDAY June 3rd -- 4th -- 5th FROM 10AM UNTILL NOON. Please make an appointment with me first through email or telephone to receive an application. This Luxury 2 Bedroom 1 bathroom apartment is located in a very quiet and family oriented location (Campbell). Apartment has been completely remodeled recently so everything is new. (Ground Floor with Large Backyard) Everything in this apartment has been remodeled: Air Conditioning -- cooling + Heating LED Recessed Lights (LOW PG&E payments) Upgraded Kitchen Upgraded Bathroom Upgraded Living Room and Bedrooms + many more Building Amenities: 1 Open parking space + many parking spaces are easily available on the street Convenient On Site Laundry (FREE) Large backyard Free Water, sewage, and garbage Nearby: Close to shopping malls, restaurants, parks and gas station Easy access to highway 17, 85, 280 Along with San Tomas Expressway Best School District Deposit $2000 + $2575 Monthly 12 months lease Pets are allowed depending on their size and breed. CALL NOW FOR AN APPOINTMENT AND TOUR OF THE APARTMENT: PLEASE CONTACT ME AT show contact info OR EMAIL THROUGH CRAIGSLIST. (Text is preferred) 163 SUPERIOR DRIVE, APARTMENT UNIT B, CAMPBELL, CA 95008 **PLEASE NOTE THAT THE FURNITURES ARE NOT INCLUDED**","cats_s":"true","street_address_s":"163 Superior Drive","page_url_s":"http://sfbay.craigslist.org/sby/apa/5609720585.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available jun 10","title_s":"**Luxury 2 Bedroom Apartment With Large Backyard**","neighborhood_s":"campbell","dogs_s":"true","housetype_s":"apartment"},
{"image_src_s":"","google_maps_link_s":"","subarea_s":"south bay","price_s":"","datetime_s":"","bodytext_s":"","street_address_s":"","page_url_s":"http://sfbay.craigslist.org/sby/apa/5577870824.html","category_s":"apts/housing for rent","title_s":"","neighborhood_s":""},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00Z0Z_jUxe1AwQQOY_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%34%31%37%35+Renaissance+Drive%2C+Unit+%34+San+Jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$3195","sqft_s":"1400","postid_s":"5595756000","datetime_s":"2016-05-20 9:44am 2016-05-20 9:44am 2016-05-31 3:07pm","bodytext_s":"Charming Town Home located in the heart of Silicon Valley Property Address 4175 Renaissance Drive, Unit 4 | San Jose, CA 95134 Available: 05/21/2016 Offered By Real Estate Connections Description Spacious, bright, and charming end unit town home we offer you has been newly renovated. This 3 bedroom 2.5 bathroom gem dual level town home includes, carpet in all bedrooms/stairwell, laminate floors throughout the living room/dining room/kitchen, washer and dryer are located in attached one car garage, and private patio. The kitchen and dining room overlooks the peaceful back patio. This home is centrally located off First and Highway 237, just minutes away from the high-tech companies located in Silicon Valley. This is a perfect place and now all it needs is you! Sorry NO Pets Please call our office BEFORE applying. To apply for this property on line please visit our web site: www.rec-rentals.com. Application fee is NON REFUNDABLE. Real Estate Connections show contact info www.rec-rentals.com CalBRE Corporation License # 01201656 Details Beds/Baths: 3BD/2.5BA Square Feet: 1,400 Rental Terms Rent: $3,195.00 Available: 05/21/2016 Application Fee: $25.00 Security Deposit: $3,250.00","street_address_s":"4175 Renaissance Drive, Unit 4","page_url_s":"http://sfbay.craigslist.org/sby/apa/5595756000.html","category_s":"apts/housing for rent","bathroom_s":"2.5","parking_s":"true","available_s":"available may 21","title_s":"Charming Town Home located in the heart of Silicon Valley","neighborhood_s":"san jose north","housetype_s":"townhouse"},
{"wheelchair_s":"true","bedroom_s":"1","image_src_s":"http://images.craigslist.org/00Z0Z_lXFe8Vl9UcH_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%38%35%30+Meridian+Way+San+Jose+CA+US","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$2339","sqft_s":"780","postid_s":"5613222830","datetime_s":"2016-05-31 3:12pm 2016-05-31 3:12pm","bodytext_s":"Charming Apartments in San Jose! Call us today! Whispering Willow -- 1  bed / 1 bath / 780 sq ft / $2,150 - $2,500 Hidden Willows 850 Meridian Way San Jose, CA 95126 Property Website: http://www.srgliving.com/hiddenwillows Want more information? http://unit-availability.com/lead/4b0100143711/1?extnId=5199866 Call Us Today! show contact info x189 Property Description Nestled in one of San Joses finest neighborhoods, Hidden Willows is conveniently located near historic downtown Willow Glen, Valley Fair Mall and Santana Row, famous for its wonderful shopping, dining, and entertainment options. The inviting surroundings, beautifully landscaped community with manicured gardens and rows of shade trees, welcome you home. Stay in shape in the fitness center, or simply relax by the sparkling pool that has free Wi-Fi. Find comfort and convenience in your renovated apartment home featuring an in-home washer and dryer, fully equipped kitchen, spacious bedroom suite,private patio with storage and USB Outlets in the Living & Bedroom(s). Floor Plan/Unit Features * View * Range * Disposal * Trash/Recycle pick up @ front door * Ceiling Fan * Central Heat * Cable * Large Closets * Window Coverings * Carport * Carpeting * Dishwasher * Separate Dining Room * Microwave * Air Conditioning * Refrigerator * Courtyard * Washer/Dryer in Unit * Patio/Balcony Parking: Type - Covered Lot Please call for parking information. Office Hours Monday:   9:00am to 6:00pm    Tuesday:   9:00am to 6:00pm    Wednesday:   9:00am to 6:00pm    Thursday:   9:00am to 6:00pm    Friday:   9:00am to 6:00pm    Saturday:   9:00am to 6:00pm    Management Company: Sares Regis Group* Call Us Today! show contact info x189 Equal Housing Opportunity","cats_s":"true","street_address_s":"850 Meridian Way","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613222830.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available may 09","title_s":"Coming home will be the best part of your day!","neighborhood_s":"willow glen / cambrian","dogs_s":"true","housetype_s":"apartment"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00M0M_eunlf24dtNz_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%36%35%35%39+Crown+Blvd+San+Jose+CA+US","subarea_s":"south bay","price_s":"$3700","sqft_s":"1800","postid_s":"5607224456","datetime_s":"2016-05-27 1:33pm 2016-05-27 1:33pm 2016-05-31 3:07pm","bodytext_s":"Higher End Duplex Near Almaden Country Club Property Address 6559 Crown Blvd | San Jose, CA 95120 Available: Now Offered By Real Estate Connections Description 1800 square feet, newer remodel. All new insulation, double paned windows and interior paint. Newer carpet and tile throughout, granite kitchen, new appliances, indoor laundry room. convenient to shopping, post office, medical offices. Private yard, separate, over-sized two car garage. Just 2.9 miles from HW 85 @ Almaden Exp. Room to bring your own refrigerator, washer and dryer. Sorry NO PETS Please call our office BEFORE applying. To apply for this property on line please visit our web site. www.rec-rentals.com. Application fee is NON REFUNDABLE. Real Estate Connections show contact info BRE CORP LIC# 01201656 Details Beds/Baths: 3BD/2.0BA Square Feet: 1,800 Rental Terms Rent: $3,700.00 Available: Now Application Fee: $25.00 Security Deposit: $3,700.00","street_address_s":"6559 Crown Blvd","page_url_s":"http://sfbay.craigslist.org/sby/apa/5607224456.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available may 27","title_s":"Higher End Duplex Near Almaden Country Club","neighborhood_s":"san jose south","housetype_s":"duplex"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/00h0h_lbEI2OELDwQ_600x450.jpg","google_maps_link_s":"","subarea_s":"south bay","laundry_s":"true","price_s":"$2500","sqft_s":"1100","postid_s":"5607260324","datetime_s":"2016-05-27 1:55pm 2016-05-27 1:55pm 2016-05-31 3:07pm","bodytext_s":"Great top floor unit, Nice floor plan with one master suit. Property Address 1055 N. Capitol Ave, Unit 20 | San Jose, CA 95133 Available: 06/17/2016 Offered By Real Estate Connections Description Condo with 2 beds, 2 baths, living/dining room combo, wall to wall carpets, refrigerator, dishwasher. Complex offers pool, clubhouse & children's play area. Water & Garbage included. . Short walk to pool. Laundry area in unit with washer/dryer and 1 car assign parking. Sorry NO PETS Please call our office BEFORE applying. To apply for this property on line please visit our web site. www.rec-rentals.com. Application fee is NON REFUNDABLE. Real Estate Connections show contact info BRE CORP LIC# 01201656 Amenities community pool clubhouse/recreation room Childrens play area Details Beds/Baths: 2BD/2.0BA Square Feet: 1,100 Rental Terms Rent: $2,500.00 Available: 06/17/2016 Application Fee: $25.00 Security Deposit: $2,600.00","street_address_s":"","page_url_s":"http://sfbay.craigslist.org/sby/apa/5607260324.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available jun 17","title_s":"Great top floor unit, Nice floor plan with one master suit.","neighborhood_s":"san jose north","housetype_s":"condo"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00h0h_ihxrodF3TY8_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%33%31%38%31+Taper+Avenue+San+Jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$2800","postid_s":"5607290815","datetime_s":"2016-05-27 2:14pm 2016-05-27 2:14pm 2016-05-31 3:07pm","bodytext_s":"Rare Month to Month Tenancy Available Up Until Next May Property Address 3181 Taper Ave | San Jose, CA 95124 Available: Now Offered By Real Estate Connections Description Charming 3/1 single family home in Cambrian Area. Refrigerator, Washer and Dryer. 2 car garage, Extra storage, Garbage and Gardener included. Convenient access to HW 85 and HW 17. Perfect for someone remodeling their home. NO PETS, Please Real Estate Connections show contact info www.rec-rentals.com DRE CORP LIC# 01201656 Details Beds/Baths: 3BD/1.0BA Rental Terms Rent: $2,800.00 Available: Now Application Fee: $25.00 Security Deposit: $2,800.00","street_address_s":"3181 Taper Avenue","page_url_s":"http://sfbay.craigslist.org/sby/apa/5607290815.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available may 27","title_s":"Rare Month to Month Tenancy Available Up Until Next May","neighborhood_s":"san jose south","housetype_s":"house"},
{"bedroom_s":"1","image_src_s":"http://images.craigslist.org/00G0G_ei4I7yG96yy_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%37%33%37%35+Rollingdell+Dr+Cupertino+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$2795","sqft_s":"823","postid_s":"5613190265","datetime_s":"2016-05-31 2:52pm 2016-05-31 2:52pm","bodytext_s":"SIENA APARTMENT HOMES IN BEAUTIFUL CUPERTINO We have a lovely 1 bedroom 1 bathroom unit available June 2016! Siena promises a blissful and comfortable lifestyle from the inside, out. Our bright and spacious apartment homes offer newly RENOVATED interiors , GRANITE countertops, newer appliances, generous storage, WASHER/DRYER on site, and AIR CONDITIONING. Our beautifully manicured landscaping features a trellised garden courtyard, as well as picnic and barbeque areas. We have a large pool with jacuzzi spa, gym and resident computer room. The Cupertino Square Shopping Center, Stevens Creek Park and Trail, Apple Campus, DeAnza College, Hwy 280 and 85 are just minutes away! **********CUPERTINO SCHOOL DISTRICT************* Our friendly and attentive staff are waiting to welcome you home. Please stop by or call our office for an appointment today. Do not miss your chance to live in a beautiful area with award winning schools! Check out our Google and Apartment Rating Reviews! Come by and take a tour today! 7375 Rollingdell Drive Cupertino, CA 95014 CALL US NOW: show contact info Website: siena.eprodesse dot com No Pets Allowed (except service animals) Resident responsible for all utilities","street_address_s":"7375 Rollingdell Dr","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613190265.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available jun 13","title_s":"(((Lovely*One Bedroom*One Bathroom*Huge*Coming Soon)))","neighborhood_s":"cupertino","housetype_s":"apartment"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/00909_qRX4r0UjwB_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%33%38+N+Almaden+Blvd+san+jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$3545","sqft_s":"1275","postid_s":"5578061167","datetime_s":"2016-05-09 1:09pm 2016-05-09 1:09pm 2016-05-31 3:04pm","bodytext_s":"Contact info: OneRent | show contact info Live in Luxury in the Gorgeous Downtown Condo 38 N Almaden Blvd #1301, San Jose, CA 95110 $3,545/mo KEY FEATURES Sq Footage: 1275 sqft. Bedrooms: 2 Beds Bathrooms: 2 Baths Parking: 2 Garage Lease Duration: 1 Year Deposit: $3,545 Pets Policy: Cats & Dogs OK Laundry: In Unit Property Type: Condo DESCRIPTION Beautiful centrally located condo. Close to schools, shopping, parks and freeways. Featuring two generous sized master bedrooms, two modern bathrooms, and approximately 1,275 square feet of living area with fireplace and incredible view! Comfortable, bright, open flow with balcony/patio. A formal dining area near kitchen. It also offers amazing hardwood floors through out, high ceilings making it more elegant, central air conditioning, a gourmet kitchen with plenty of cabinet space and comes with newer stainless steel appliances. Lots of guest parking in the complex. Amenities include nice fitness center and barbecue area. Plus, there is a shared pool perfect for summer and 2 car attached garage as well. Walking distance from SAP center. With ease access to anything in Downtown San Jose. Owner is leaving flat screen TV and sound system. RENTAL FEATURES Master bath Range / Oven Refrigerator Dishwasher Microwave Garbage disposal Stainless steel appliances Balcony, Deck, or Patio Heat: forced air Central A/C Cable-ready High-speed internet Hardwood floor COMMUNITY FEATURES Secured entry Covered parking Garage - Attached Garage - Detached Contact info: OneRent show contact info","cats_s":"true","street_address_s":"38 N Almaden Blvd","page_url_s":"http://sfbay.craigslist.org/sby/apa/5578061167.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available may 09","title_s":"Live in Luxury in the Gorgeous Downtown Condo","neighborhood_s":"san jose","dogs_s":"true","housetype_s":"condo"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00P0P_l1244eQgMXJ_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%37%34%32+San+Rafael+St+sunnyvale+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$3200","sqft_s":"1180","postid_s":"5573864101","datetime_s":"2016-05-06 2:17pm 2016-05-06 2:17pm 2016-05-31 3:04pm","bodytext_s":"Contact info: OneRent | show contact info Beautiful Home in Unique and Serene Neighborhood 742 San Rafael St, Sunnyvale, CA 94085 $3,200/mo KEY FEATURES Sq Footage: 1180 sqft. Bedrooms: 3 Beds Bathrooms: 2 Baths Parking: None Lease Duration: 1 Year Deposit: $3,500 Pets Policy: Cats & Dogs OK Laundry: In Unit Property Type: Single Family House DESCRIPTION A beautiful home nestled in a great neighborhood. Featuring a very nice open floor plan with 3 beds and 2 full baths both are updated with well styled vinyl flooring, approximately 1,107 square feet of living space. All bedrooms are of good size and offer their own touch of character. Step into the entry with the elegant living room enchanted by a cozy a fireplace. Forced air and central A/C. Well ventilated by many ceiling fans surround. Spacious gourmet kitchen with amusing breakfast nook area, also includes newer stainless steel appliances. Close to shopping, schools and lots of great places to eat nearby. Easy access to 101. RENTAL FEATURES Living room Master bath Breakfast nook Range / Oven Refrigerator Dishwasher Garbage disposal Balcony, Deck, or Patio Yard Heat: forced air Central A/C Ceiling fans Hardwood floor Fireplace Contact info: OneRent show contact info","cats_s":"true","street_address_s":"742 San Rafael St","page_url_s":"http://sfbay.craigslist.org/sby/apa/5573864101.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available may 06","title_s":"Beautiful Home in Unique and Serene Neighborhood","neighborhood_s":"sunnyvale","dogs_s":"true","housetype_s":"house"},
{"bedroom_s":"1","image_src_s":"http://images.craigslist.org/00x0x_4RUxcMqZ249_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%36%32%35%34+santa+teresa+blvd+san+jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$1899","sqft_s":"581","postid_s":"5613217338","datetime_s":"2016-05-31 3:08pm 2016-05-31 3:08pm","bodytext_s":"Your New Home CALL: show contact info x199 $1,999 . 1 Bed 1 Bath . 581 sq ft Santa Teresa Apartments : 6254 Santa Teresa Blvd San Jose, CA 95119 Property Website: http://www.santateresaapartmenthomes.com Want more information? http://unit-availability.com/lead/601352167280/1?extnId=5789606 DESCRIPTION Live in a tranquil one-bedroom, one-bathroom home at Santa Teresa! Cozy carpeting is laid throughout the home. Central heat and air conditioning is included to provide convenience through various seasons. Additionally, a ceiling fan can be a decent alternative to retain cool air flow and help reduce utility costs. The kitchen comprises of granite countertops and stainless steel appliances for ease in cooking. It includes a dishwasher and garbage disposal essential to household tasks. An abundance of large closets help you keep a neat living space. After a hard day's work, find time to relax at the clubhouse with your guests and neighbors. You can also indulge in the heated swimming pool or engage in various exercise routines at the fitness center. Tour the community and settle in! OFFICE  HOURS Monday 8:30am to 5:30pm    Tuesday 8:30am to 5:30pm    Wednesday 8:30am to 5:30pm    Thursday 8:30am to 5:30pm    Friday 8:30am to 5:30pm    Saturday 8:30am to 5:30pm    CALL US TODAY! show contact info x199 Equal Housing Opportunity","cats_s":"true","street_address_s":"6254 santa teresa blvd","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613217338.html","category_s":"apts/housing for rent","bathroom_s":"1","available_s":"available may 31","title_s":"Stainless Steel Appliances in a 1BR/1BA Home for Lease!","neighborhood_s":"san jose south","dogs_s":"true","housetype_s":"apartment"},
{"bedroom_s":"0","image_src_s":"http://images.craigslist.org/00O0O_86tM4Va8gXb_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%34%32%37+S%2E+Third+Street+Ca+CA+US","subarea_s":"south bay","price_s":"$1450","sqft_s":"325","postid_s":"5594223655","datetime_s":"2016-05-19 10:37am 2016-05-19 10:37am 2016-05-31 3:24pm","bodytext_s":"CONTACT INFO Armida Flores show contact info $1450.00 STUDIO- Available NOW!!!!!OPEN HOUSE 5/27 from 1pm to 3pm - $1,450.00 per month 427 S. Third Street, San Jose , CA 95020 FEATURES Bedrooms: 0 Bathrooms: 1 Located on Floor #: 2 Square Footage: 335 Pets Allowed: None DESCRIPTION We are currently offering a cozy nice little studio near downtown San Jose.  Studio in the 2nd floor. . If you have any questions please feel free to call our office one of our team members will be happy to assist you. ***PICTURES ARE OF THE STUDIO UNIT AVAILABLE*** COMPLETELY Renovated features such as. . . - Brand new doors throughout unit -New Flooring - New finish on Counter tops - Wooden blinds - Refrigerator -Dishwasher - Oven/Stove Rent Info: Deposit: $1000.00 OAC Rent: $1450.00 Available: NOW 1 Year Lease *Utilities are not included Additional Info: Application Fee: $35 per application Refundable holding deposit of $200 to hold apartment We are sorry but we are not currently accepting Section 8 **NO Pets** Office Hours: Mon-Fri 8:00am- 5:00 pm Montebello Ridge Apartments 60 West 4th Street Ste#209 Gilroy, CA 95020 show contact info RENTAL UNIT AMENITIES Refrigerator OTHER PRICING DETAILS Available Date:   Thu Jun 30, 2016 Deposit:   1,000.00 OAC Minimum Lease:   12 Included Utilities:   NONE","street_address_s":"427 S. Third Street","page_url_s":"http://sfbay.craigslist.org/sby/apa/5594223655.html","category_s":"apts/housing for rent","bathroom_s":"Other","available_s":"available jun 30","title_s":"$1,450.00 Studio Availablo NOW!! Open House 4/27 from 1pm to 3pm","neighborhood_s":"san jose downtown","housetype_s":"apartment"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/00v0v_5wR8ASsKUI8_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%35%36%39%36+Hollyleaf+Lane+san+jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$3400","sqft_s":"975","postid_s":"5577783075","datetime_s":"2016-05-09 10:48am 2016-05-09 10:48am 2016-05-31 3:02pm","bodytext_s":"Contact info: Dylan Trujillo | OneRent | show contact info 2Bd/2Ba Townhouse 5696 Hollyleaf Ln #1a, San Jose, CA 95118 $3,400/mo KEY FEATURES Sq Footage: 975 sqft. Bedrooms: 2 Beds Bathrooms: 2 Baths Parking: 2 Garage Lease Duration: 1 Year Deposit: $3,400 Pets Policy: Cats & Dogs OK Laundry: In Unit Property Type: Townhouse RENTAL FEATURES Living room Dining room Master bath Storage space Pantry Attic Range / Oven Refrigerator Dishwasher Microwave Garbage disposal Stainless steel appliances Freezer Balcony, Deck, or Patio Heat: forced air Air conditioning Cable-ready Hardwood floor COMMUNITY FEATURES Garage - Attached Garage - Detached Contact info: Dylan Trujillo OneRent show contact info","cats_s":"true","street_address_s":"5696 Hollyleaf Lane","page_url_s":"http://sfbay.craigslist.org/sby/apa/5577783075.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available may 09","title_s":"Beautiful Home in peaceful neighborhood","neighborhood_s":"san jose","dogs_s":"true","housetype_s":"condo"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/01717_1uIRxuxlUTS_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%31%38%33%35+Palm+View+Pl+santa+clara+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$2995","sqft_s":"950","postid_s":"5572284298","datetime_s":"2016-05-05 2:23pm 2016-05-05 2:23pm 2016-05-31 3:00pm","bodytext_s":"Contact info: OneRent | show contact info 2Bd/2Ba Condo 1835 Palm View Pl #101, Santa Clara, CA 95050 $2,995/mo KEY FEATURES Sq Footage: 950 sqft. Bedrooms: 2 Beds Bathrooms: 2 Baths Parking: None Lease Duration: 1 Year Deposit: $2,995 Pets Policy: No Pets Allowed Laundry: In Unit Property Type: Condo RENTAL FEATURES Range / Oven Refrigerator Dishwasher Microwave Stainless steel appliances Balcony, Deck, or Patio Heat: forced air Air conditioning High-speed internet Hardwood floor Granite countertop Jacuzzi / Whirlpool Contact info: OneRent show contact info","cats_s":"true","street_address_s":"1835 Palm View Pl","page_url_s":"http://sfbay.craigslist.org/sby/apa/5572284298.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available may 05","title_s":"Unique and Captivating Condo Unit in Serene Setting.","neighborhood_s":"santa clara","dogs_s":"true","housetype_s":"condo"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/00909_qRX4r0UjwB_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%33%38+N+Almaden+Blvd+san+jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$3545","sqft_s":"1275","postid_s":"5572368139","datetime_s":"2016-05-05 3:20pm 2016-05-05 3:20pm 2016-05-31 3:00pm","bodytext_s":"Contact info: OneRent | show contact info Live in Luxury in the Gorgeous Downtown Condo 38 N Almaden Blvd #1301, San Jose, CA 95110 $3,545/mo KEY FEATURES Sq Footage: 1275 sqft. Bedrooms: 2 Beds Bathrooms: 2 Baths Parking: 2 Garage Lease Duration: 1 Year Deposit: $3,545 Pets Policy: Cats & Dogs OK Laundry: In Unit Property Type: Condo DESCRIPTION Beautiful centrally located condo. Close to schools, shopping, parks and freeways. Featuring two generous sized master bedrooms, two modern bathrooms, and approximately 1,275 square feet of living area with fireplace and incredible view! Comfortable, bright, open flow with balcony/patio. A formal dining area near kitchen. It also offers amazing hardwood floors through out, high ceilings making it more elegant, central air conditioning, a gourmet kitchen with plenty of cabinet space and comes with newer stainless steel appliances. Lots of guest parking in the complex. Amenities include nice fitness center and barbecue area. Plus, there is a shared pool perfect for summer and 2 car attached garage as well. Walking distance from SAP center. With ease access to anything in Downtown San Jose. Owner is leaving flat screen TV and sound system. RENTAL FEATURES Master bath Range / Oven Refrigerator Dishwasher Microwave Garbage disposal Stainless steel appliances Balcony, Deck, or Patio Heat: forced air Central A/C Cable-ready High-speed internet Hardwood floor COMMUNITY FEATURES Secured entry Covered parking Garage - Attached Garage - Detached Contact info: OneRent show contact info","cats_s":"true","street_address_s":"38 N Almaden Blvd","page_url_s":"http://sfbay.craigslist.org/sby/apa/5572368139.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available may 05","title_s":"Live in Luxury in the Gorgeous Downtown Condo","neighborhood_s":"san jose","dogs_s":"true","housetype_s":"condo"},
{"bedroom_s":"1","image_src_s":"http://images.craigslist.org/00Z0Z_jzcNcCWsZNQ_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%31%35%30+East+Remington+Drive+Sunnyvale+CA+US","subarea_s":"south bay","price_s":"$2325","postid_s":"5613211389","datetime_s":"2016-05-31 3:05pm 2016-05-31 3:05pm","bodytext_s":"Welcome home to Lincoln Glen Apartments! 1B1B ? 1  bed / 1 bath / 563 sq ft / $2,325 150 East Remington Drive Sunnyvale, ca 94087 Want more information? http://unit-availability.com/lead/5n01v3748379/1?extnId=5925148 Call Us Today! show contact info x133 Property Description When you're not relaxing in the comfort of this beautiful garden-style one-bedroom apartment, help yourself to the benefits of a free fitness center, on-site tennis court, and a refreshing swimming pool. This home has everything you need and expect, including air conditioning. Call now Floor Plan/Unit Features * Air Conditioning * Beautiful Garden Views * Generous Walk-in Closets * Modern Kitchens * Private Patios & Balconies Property Amenities * Air Conditioning * Swimming Pool * Covered Parking * Close to 85, 101, and 280 freeways * 24 hour emergency service * Cable Ready * Close to shopping and restaurants * Relaxing Sauna Lease Terms: 3, 6 & 12 months Parking: Type - Covered Lot Covered parking for most cars. Please call for parking information. Pet Policy: No pets allowed. Year Built: 1978 Remodeled: 2000 Units: 112 Management Company: Woodmont Real Estate Services* Call Us Today! show contact info x133 Equal Housing Opportunity","street_address_s":"150 East Remington Drive","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613211389.html","category_s":"apts/housing for rent","bathroom_s":"Other","available_s":"available jul 15","title_s":"CUPERTINO SCHOOL DISTRICT!","neighborhood_s":"sunnyvale","housetype_s":"apartment"},
{"wheelchair_s":"true","bedroom_s":"2","image_src_s":"http://images.craigslist.org/00U0U_hdgCM4yS5mP_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%31%32%30%31Parkmoor+Ave+San+Jose+CA+US","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$3200","sqft_s":"1242","postid_s":"5613211195","datetime_s":"2016-05-31 3:05pm 2016-05-31 3:05pm","bodytext_s":"Elements http://www.elementsapts.com/su/jnj7 Floor Plan: Plan 6 Sq Feet: 1242 Rent: $3200 - $4260.00 Deposit: $600.00 - $600.00 Bed/Bath: 2/2 Community Amenities Executive Business Center Resident Lounge We Love Pets!* Extra Storage Wi-Fi in Common Areas Complete Fitness Center Professional On-Site Management Media Center Reserved Underground Parking Smoke-Free Community Electric Vehicle EV Charging Stations Pool View Resort-Inspired Pool, Spa & Sun Terrace View End Unit Access - Freeway/Street Floor - Third View - Courtyard Unique Unit Type Floor - First Floor - Top View - Premiere Extra patio Interior - Extra Windows/Sunny Location - Exterior/Private Off Street Patio/Bal - Deck WiFi Contact Us Elements Address:1201 Parkmoor Avenue, San Jose, CA 95126 Phone: show contact info Online:http://www.elementsapts.com/su/jnj7 Office Hours: Mon: 9:00am - 6:00pm Tue: 9:00am - 6:00pm Wed: 9:00am - 6:00pm Thu: 9:00am - 6:00pm Fri: 9:00am - 6:00pm Sat: 9:00am - 6:00pm Sun: 9:00am - 6:00pm ADA ACCESSIBLE EQUAL HOUSING OPPORTUNITY Cat, CA, Dog, San Jose, Elements, Apartments to rent","cats_s":"true","street_address_s":"1201Parkmoor Ave","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613211195.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available jun 09","title_s":"Elements, providing the perfect recipe for a spacious, modern apt!!!!!","neighborhood_s":"willow glen / cambrian","dogs_s":"true","housetype_s":"apartment"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/01010_9dtojsim74S_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%34%33%34+Hogarth+Terrace+sunnyvale+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$4395","sqft_s":"1419","postid_s":"5605234977","datetime_s":"2016-05-26 9:44am 2016-05-26 9:44am 2016-05-31 2:59pm","bodytext_s":"Contact info: OneRent | show contact info 3Bd/2.5Ba Townhouse 434 Hogarth Terrace, Sunnyvale, CA 94087 $4,395/mo KEY FEATURES Sq Footage: 1419 sqft. Bedrooms: 3 Beds Bathrooms: 2.5 Baths Parking: None Lease Duration: 1 Year Deposit: $4,600 Pets Policy: No Pets Allowed Laundry: In Unit Property Type: Townhouse RENTAL FEATURES Range / Oven Refrigerator Dishwasher Microwave Garbage disposal Balcony, Deck, or Patio Heat: forced air Double pane / Storm windows Granite countertop Fireplace High / Vaulted ceiling Contact info: OneRent show contact info","street_address_s":"434 Hogarth Terrace","page_url_s":"http://sfbay.craigslist.org/sby/apa/5605234977.html","category_s":"apts/housing for rent","bathroom_s":"2.5","parking_s":"true","available_s":"available may 26","title_s":"Live Among Redwoods in Sunnyvale","neighborhood_s":"sunnyvale","housetype_s":"townhouse"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/00s0s_eBlUDsFGQh6_600x450.jpg","google_maps_link_s":"https://maps.google.com/maps/preview/@37.429751,-121.969185,16z","subarea_s":"south bay","laundry_s":"true","price_s":"$2600","sqft_s":"668","postid_s":"5588199389","datetime_s":"2016-05-15 7:06pm 2016-05-15 7:06pm 2016-05-31 2:59pm","bodytext_s":"Completely Remodeled Interior and exterior with new windows, tank less water heater. Stainless steel appliances. Everything new. This 3 unit duplex lives similar to a condo setting. Great location, north San Jose. Quiet community away from congestion with biking trails, salt pond, wildlife and bird watching. Yet, easy access to freeways 237, 880, close proximity to Santa Clara Golf and Tennis club and the bay, Great Mall, Santa Clara Convention Center, Levi Stadium. 2 bedroom 1 bath 2 car garage No Pets No Smoking Term: 1 year minimum- longer preferred Please respond with direct email and contact number. Briefly outline your housing needs in your introduction along with your start date.","street_address_s":"","page_url_s":"http://sfbay.craigslist.org/sby/apa/5588199389.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available jun 01","title_s":"Completely Remodeled unit with & 2 car garage","neighborhood_s":"san jose north","housetype_s":"duplex"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00P0P_dJaNFmyU5OL_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%34%31%37%37+Boneso+Cir+san+jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$3145","sqft_s":"1139","postid_s":"5577773688","datetime_s":"2016-05-09 10:44am 2016-05-09 10:44am 2016-05-31 2:59pm","bodytext_s":"Contact info: OneRent | show contact info Gorgeous 3 Bedroom Condo in Perfect Location 4177 Boneso Circle, San Jose, CA 95134 $3,145/mo KEY FEATURES Sq Footage: 1139 sqft. Bedrooms: 3 Beds Bathrooms: 2.5 Baths Parking: None Lease Duration: 1 Year Deposit: $3,145 Pets Policy: No Pets Allowed Laundry: In Unit Property Type: Condo DESCRIPTION Beautiful 3 Bed condo close Santa Row with many dining and shopping options, easy access to VTA, 237, 101, and 880. Open living space includes vaulted ceilings, natural light, private patio, and master bed/bath. This unit also comes with a gas fireplace, central heating and AC, and a washer and dryer in unit. 1 car garage parking included. The complex includes beautifully landscaped grounds with a shared pool and spa! Schedule a showing today before this rare find is taken! RENTAL FEATURES Range / Oven Refrigerator Dishwasher Garbage disposal Balcony, Deck, or Patio Heat: forced air Ceiling fans High-speed internet Hardwood floor Tile floor Fireplace Contact info: OneRent show contact info","street_address_s":"4177 Boneso Cir","page_url_s":"http://sfbay.craigslist.org/sby/apa/5577773688.html","category_s":"apts/housing for rent","bathroom_s":"2.5","parking_s":"true","available_s":"available may 09","title_s":"Gorgeous 3 Bedroom Condo in Perfect Location","neighborhood_s":"san jose","housetype_s":"condo"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/00x0x_5DXj0JTOL8V_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%36%31%36+San+Luisito+Way+Sunnyvale+CA+US","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$2675","sqft_s":"910","postid_s":"5613209125","datetime_s":"2016-05-31 3:03pm 2016-05-31 3:03pm","bodytext_s":"Sunnyvale Duplex! Property Address 616 San Luisito Way | Sunnyvale, CA 94085 Available: 06/01/2016 Offered By GS Property Management, Inc.  |  show contact info Description Welcome to this two bed one bath duplex with tile in the bathroom and kitchen, gas stove, and fridge. Both bedrooms provide ample space and nice size closets with plenty of storage space throughout the unit. The open floor plan from the kitchen to the living room allows for lots of natural light and a private back patio. The unit also includes a separate laundry room with a washer and dryer. This unit has two parking spaces, one covered and one uncovered. Located near both Lawrence Expressway and 101 and not too far from 237, it offers easy access to the hi-tech companies in the area. The property is located within walking distance to local schools, restaurants, and parks. Amenities Gas Range Refrigerator New Floors in Kitchen New Floors in Bathroom New Vanity in Bathroom In-Door Laundry Room Washer/ Dryer New Interior Paint Private Back Patio 1 Covered Carport 1 Open Parking Space Renter Pays Gas Renter Pays Electric Renter to Confirm Schools Renters Insurance Required No Pets Details Beds/Baths: 2BD/1.0BA Square Feet: 910 Rental Terms Rent: $2,675.00 Available: 06/01/2016 Application Fee: $35.00 Security Deposit: $2,675.00","street_address_s":"616 San Luisito Way","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613209125.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available may 31","title_s":"Sunnyvale Duplex!","neighborhood_s":"sunnyvale","housetype_s":"duplex"},
{"bedroom_s":"3","image_src_s":"","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%32%35%38%36+Mabury+Square+san+jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$3250","sqft_s":"1699","postid_s":"5605292421","datetime_s":"2016-05-26 10:15am 2016-05-26 10:15am 2016-05-31 2:58pm","bodytext_s":"Contact info: OneRent | show contact info 3Bd/3Ba Single Family House 2586 Mabury Square, San Jose, CA 95133 $3,250/mo KEY FEATURES Sq Footage: 1699 sqft. Bedrooms: 3 Beds Bathrooms: 3 Baths Parking: None Lease Duration: 1 Year Deposit: $3,250 Pets Policy: No Pets Allowed Laundry: In Unit Property Type: Single Family House RENTAL FEATURES Range / Oven Refrigerator Dishwasher Microwave Fenced yard Heat: forced air Central A/C High-speed internet Hardwood floor Granite countertop Fireplace Contact info: OneRent show contact info","street_address_s":"2586 Mabury Square","page_url_s":"http://sfbay.craigslist.org/sby/apa/5605292421.html","category_s":"apts/housing for rent","bathroom_s":"3","parking_s":"true","available_s":"available may 26","title_s":"Charming Home with Lots of Beautiful Unique Characteristics.","neighborhood_s":"san jose","housetype_s":"house"},
{"bedroom_s":"4","image_src_s":"http://images.craigslist.org/00T0T_84Tn3pPAp4I_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+Queensbrook+Drive+San+Jose+CA+US","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$4250","sqft_s":"1598","postid_s":"5613249215","datetime_s":"2016-05-31 3:29pm 2016-05-31 3:29pm","bodytext_s":"4 Bed, 2.5 Bath Beautiful Townhouse @ Regency Park Property Address 1072 Queensbrook Drive | San Jose, CA 95129 Available: 06/15/2016 Offered By M Properties  |  show contact info Description 4 Bed, 2.5 Bath Townhouse located at Regency Park community in San Jose. This community features a Community Pool, Club House and Children's Playground. Townhome is within walking distance to Top Rated and Award Winning schools including Delworth Elementary, Miller Middle School, and Lynbrook High School The townhouse is also convenient to great shopping and restaurants including Safeway. The home features hardwood floors throughout, updated kitchen with stainless steel appliances and granite counters. The home includes a detached garage, and backyard with direct access to a shared playground. Features: - 4 BED - 2.5 BATH - Master Suite includes a private patio - Hardwood floors throughout - Spacious Living Area - Stainless Steel Appliances - Washer and Dryer - Detached Garage Amenities: - Community Pool - Clubhouse - Playground - Convenient to shops, grocery stores, and Restaurants - Convenient to Public Transportation (VTA 25 & 26) - Top Rated and Award Winning schools including Delworth Elementary, Miller Middle School, and Lynbrook High School Showings: - By Appointment only Lease Terms: - 12 Month Lease Required - Security Deposit $6,375 - Renters Insurance Required - Tenant pay PG&E - Owner pays for Water and Trash - No Smoking & No Pets Application Process: - Apply Online - $35 Application Fee per Adult Details Beds/Baths: 4BD/2.5BA Square Feet: 1,598 Rental Terms Rent: $4,250.00 Available: 06/15/2016 Application Fee: $35.00 Security Deposit: $6,375.00","street_address_s":"Queensbrook Drive","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613249215.html","category_s":"apts/housing for rent","bathroom_s":"2.5","parking_s":"true","available_s":"available jun 15","title_s":"4 Bed, 2.5 Bath Beautiful Townhouse @ Regency Park","neighborhood_s":"san jose west","housetype_s":"townhouse"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/01515_5klSJSNcW54_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%31%30%35+Oak+Rim+Ct%2E+Los+Gatos+CA+US","subarea_s":"south bay","price_s":"$3195","sqft_s":"1150","postid_s":"5607690908","datetime_s":"2016-05-27 7:37pm 2016-05-27 7:37pm 2016-05-31 2:58pm","bodytext_s":"OPEN HOUSE 5/28_ 10:30 - 11:30 AM Quiet setting in gorgeous Los Gatos. 2 bedroom / 1 Bath Security deposit is $3195 Remodeled Kitchen, Bath and new flooring. large private and secured patio. Amenities: Beautiful Pool and Barbecue Area Secluded Garden Setting in Quiet Los Gatos Walk to Vasona Park, Lake, Trails, and Old Town Los Gatos Shopping Center, Cafes, and Shops Easy access to Major Freeways of Hwy 9, 17 and 85 Washer and dryer Nestled among lawns and trees in a park like setting. Famous, top-rated Los Gatos schools near by: Louise Van Meter Elementary School, Raymond J. Fisher Middle School, Los Gatos High School Cat friendly with additional deposit and rent. Storage Lockers available. Water and trash are included in rent. Ready for immediate move-in","cats_s":"true","street_address_s":"105 Oak Rim Ct.","page_url_s":"http://sfbay.craigslist.org/sby/apa/5607690908.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available may 27","title_s":"OPEN HOUSE SAT 6/4 10:30 - 11:30 AM_Los Gatos 2 BD / 1 BA","neighborhood_s":"los gatos","dogs_s":"true","housetype_s":"apartment"},
{"wheelchair_s":"true","bedroom_s":"1","image_src_s":"http://images.craigslist.org/01515_5klSJSNcW54_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%31%30%35+Oak+Rim+Ct%2E+Los+Gatos+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$1995","postid_s":"5596634888","datetime_s":"2016-05-20 7:35pm 2016-05-20 7:35pm 2016-05-31 2:57pm","bodytext_s":"OPEN HOUSE 5/28_ 10:30 - 11:30 AM $1950 / 1 bedroom and 1 bath Quiet setting in gorgeous Los Gatos. 1 bedroom / 1 Bath Security deposit is $1,950 Granite counters in the kitchen, newer stainless steel stove, hardwood floors and track lighting in the living room, large private and secured patio in the front. Amenities: Beautiful Pool and Barbecue Area Secluded Garden Setting in Quiet Los Gatos Walk to Vasona Park, Lake, Trails, and Old Town Los Gatos Shopping Center, Cafes, and Shops Easy access to Major Freeways of Hwy 9, 17 and 85 Washer and dryer Nestled among lawns and trees in a park like setting. Famous, top-rated Los Gatos schools near by: Louise Van Meter Elementary School, Raymond J. Fisher Middle School, Los Gatos High School Cat friendly with additional deposit and rent. Storage Lockers available. Water and trash are included in rent. Ready for immediate move-in Interested parties can call show contact info Thanks.","cats_s":"true","street_address_s":"105 Oak Rim Ct.","page_url_s":"http://sfbay.craigslist.org/sby/apa/5596634888.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available may 25","title_s":"OPEN HOUSE 5/28 10:30-11:30 AM_BD/1BA_PVT PATIO_WASH/DRY_UPDATED KIT","neighborhood_s":"los gatos","dogs_s":"true","housetype_s":"apartment"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00P0P_dJaNFmyU5OL_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%34%31%37%37+Boneso+Cir+san+jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$3145","sqft_s":"1139","postid_s":"5605362872","datetime_s":"2016-05-26 10:52am 2016-05-26 10:52am 2016-05-31 2:57pm","bodytext_s":"Contact info: OneRent | show contact info Gorgeous 3 Bedroom Condo in Perfect Location 4177 Boneso Circle, San Jose, CA 95134 $3,145/mo KEY FEATURES Sq Footage: 1139 sqft. Bedrooms: 3 Beds Bathrooms: 2.5 Baths Parking: None Lease Duration: 1 Year Deposit: $3,145 Pets Policy: No Pets Allowed Laundry: In Unit Property Type: Condo DESCRIPTION Beautiful 3 Bed condo close Santa Row with many dining and shopping options, easy access to VTA, 237, 101, and 880. Open living space includes vaulted ceilings, natural light, private patio, and master bed/bath. This unit also comes with a gas fireplace, central heating and AC, and a washer and dryer in unit. 1 car garage parking included. The complex includes beautifully landscaped grounds with a shared pool and spa! Schedule a showing today before this rare find is taken! RENTAL FEATURES Range / Oven Refrigerator Dishwasher Garbage disposal Balcony, Deck, or Patio Heat: forced air Ceiling fans High-speed internet Hardwood floor Tile floor Fireplace Contact info: OneRent show contact info","street_address_s":"4177 Boneso Cir","page_url_s":"http://sfbay.craigslist.org/sby/apa/5605362872.html","category_s":"apts/housing for rent","bathroom_s":"2.5","parking_s":"true","available_s":"available may 26","title_s":"Gorgeous 3 Bedroom Condo in Perfect Location","neighborhood_s":"san jose","housetype_s":"condo"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00r0r_hlNg8pSmhcX_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%31%32%30%36+Weepinggate+Ln+san+jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$2850","sqft_s":"1296","postid_s":"5605300123","datetime_s":"2016-05-26 10:19am 2016-05-26 10:19am 2016-05-31 2:56pm","bodytext_s":"Contact info: OneRent | show contact info Fantastic 3 Bedroom Condo in Ideal Location. 1206 Weepinggate Ln, San Jose, CA 95136 $2,850/mo KEY FEATURES Sq Footage: 1296 sqft. Bedrooms: 3 Beds Bathrooms: 1.5 Baths Parking: None Lease Duration: 1 Year Deposit: $2,850 Pets Policy: Cats & Dogs OK Laundry: In Unit Property Type: Condo DESCRIPTION Fantastic condo situated in great Edenvale neighborhood. Featuring 3 huge bedrooms, 1.5 nice baths, and roughly about 1,296 square feet of living space. This classic beauty is both dazzling and inviting. Ideally suited for both entertaining and privacy. An elegant home offering luxurious comfort in every room. The open floor plan features spacious living, dining, and sun rooms. A tastefully updated kitchen featuring newer stainless steel appliances such as refrigerator, oven, dish washer, and trash compactor. This home also comes with a fenced yard and plenty of room to relax and enjoy family time. Some of the excellent amenities includes forced air, high speed internet and other utilities ready, in-unit laundry, plus a shared pool. Very convenient location. Close to everything. RENTAL FEATURES Range / Oven Refrigerator Dishwasher Garbage disposal Stainless steel appliances Fenced yard Heat: forced air High-speed internet Hardwood floor Fireplace Contact info: OneRent show contact info","cats_s":"true","street_address_s":"1206 Weepinggate Ln","page_url_s":"http://sfbay.craigslist.org/sby/apa/5605300123.html","category_s":"apts/housing for rent","bathroom_s":"1.5","parking_s":"true","available_s":"available may 26","title_s":"Fantastic 3 Bedroom Condo in Ideal Location.","neighborhood_s":"san jose","dogs_s":"true","housetype_s":"condo"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00x0x_4QyX40BgCo2_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%32%37%36%33+Longford+Dr+san+jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$3645","sqft_s":"1600","postid_s":"5605276684","datetime_s":"2016-05-26 10:06am 2016-05-26 10:06am 2016-05-31 2:56pm","bodytext_s":"Contact info: OneRent | show contact info Beautiful 3 Bedroom Home with Master Suite and Upgrades 2763 Longford Dr, San Jose, CA 95132 $3,645/mo KEY FEATURES Sq Footage: 1600 sqft. Bedrooms: 3 Beds Bathrooms: 3 Baths Parking: None Lease Duration: 1 Year Deposit: $3,645 Pets Policy: No Pets Allowed Laundry: In Unit Property Type: Single Family House DESCRIPTION The home has 3 bed rooms, family room, living room and 3 full baths. The family room which has an attached bath can serve as another bed room. The home has a nice front yard in a quiet residential neighborhood. This home offers a beautiful kitchen with tile floors, and granite counter tops. Double pane windows throughout, all rooms are bright and airy. The master bedroom suite along with two other light filled bedrooms, and spacious living areas, make this a perfect home. The fended backyard contains beautiful lemon, persimmon, and pomegranate trees. Washer and Dryer are in the attached garage. The home has basic furnishing - a dining table with chairs and two sofas. 24 hour groceries (Safeway, Save mart, Local Food Groceries) and pharmacy nearby. Walkable distance to elementary school and parks. Minutes away from Great Mall, the light rail station, and the new BART station (to be opened). The home has 3 bed rooms, family room, living room and 3 full baths. The family room which has an attached bath can serve as another bed room. The home has a nice front yard in a quiet residential neighborhood. This home offers a beautiful kitchen with tile floors, and granite counter tops. Double pane windows throughout, all rooms are bright and airy. The master bedroom suite along with two other light filled bedrooms, and spacious living areas, make this a perfect home. The fended backyard contains beautiful lemon, persimmon, and pomegranate trees. Washer and Dryer are in the attached garage. The home has basic furnishing - a dining table with chairs and two sofas. 24 hour groceries (Safeway, Save mart, Local Food Groceries) and pharmacy nearby. Walkable distance to elementary school and parks. Minutes away from Great Mall, the light rail station, and the new BART station (to be opened). RENTAL FEATURES Living room Range / Oven Refrigerator Dishwasher Microwave Garbage disposal Lawn Garden Heat: forced air Central A/C Double pane / Storm windows High-speed internet Hardwood floor Tile floor Granite countertop Fireplace Skylights Contact info: OneRent show contact info","street_address_s":"2763 Longford Dr","page_url_s":"http://sfbay.craigslist.org/sby/apa/5605276684.html","category_s":"apts/housing for rent","bathroom_s":"3","parking_s":"true","available_s":"available may 26","title_s":"Beautiful 3 Bedroom Home with Master Suite and Upgrades","neighborhood_s":"san jose","housetype_s":"house"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/00E0E_hW67p6En9v0_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%32%32%33%36%32+McClellan+Road+Cupertino+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$3100","sqft_s":"1100","postid_s":"5607065959","datetime_s":"2016-05-27 12:02pm 2016-05-27 12:02pm 2016-05-31 2:56pm","bodytext_s":"2 Bedroom, 1 Bathroom Single Story DUPLEX with 1-car garagePrivate back yard and comes with GardenerWASHER & DRYER INCLUDED NO PETS ! NO SMOKING INSIDE ! Please drive by first then contact our office at show contact info to make an appointment to see inside. Check out all of our rentals on our website at http://www.hillandcorealtors.com DRE 01060930 • Schools listed subject to District Availability! • We have 24 Hour Maintenance on call","street_address_s":"22362 McClellan Road","page_url_s":"http://sfbay.craigslist.org/sby/apa/5607065959.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available may 27","title_s":"2 Bedroom/1 Bath DUPLEX ( 22362 McClellan Road )","neighborhood_s":"cupertino","housetype_s":"duplex"},
{"bedroom_s":"1","image_src_s":"http://images.craigslist.org/00x0x_9FpFikHSVDc_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%31%39%30%31+Halford+Ave+Santa+Clara+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$2295","sqft_s":"630","postid_s":"5613205134","datetime_s":"2016-05-31 3:01pm 2016-05-31 3:01pm","bodytext_s":"Halford Gardens is nestled in a quiet neighborhood walking distance to great restaurants and shopping. Call for more details! This one bedroom apartment has a full modern kitchen with energy efficient appliances. This apartment requires a $400 deposit. Halford Gardens, managed by On-Site Team 1901 Halford Ave Santa Clara, CA 95051 show contact info Monday 9:00am - 6:00pm Tuesday 9:00am - 6:00pm Wednesday 9:00am - 6:00pm Thursday 9:00am - 6:00pm Friday 9:00am - 6:00pm Saturday 9:00am - 6:00pm Sunday 10:00am - 5:00pm Community Features * Fitness Studio * Covered Parking * Reserved Parking * Easy Freeway Access * Professionally Managed * After-Hours Emergency Maintenance * Minutes from Restaurants, Shopping, and Much More * Easy Access to Public Transportation * Shimmering Pool * Laundry Care Center * Playground * Spa [#2565402]","street_address_s":"1901 Halford Ave","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613205134.html","category_s":"apts/housing for rent","bathroom_s":"1","available_s":"available may 31","title_s":"Reserved covered parking, private bike lockers, spa, wood flr, granite","neighborhood_s":"santa clara","housetype_s":"apartment"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00e0e_cqNNtw6L4ZC_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%32%36%30%31+Cortez+Dr+Unit+%31%32%30%35+santa+clara+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$2995","sqft_s":"974","postid_s":"5605312822","datetime_s":"2016-05-26 10:25am 2016-05-26 10:25am 2016-05-31 2:56pm","bodytext_s":"Contact info: OneRent | show contact info Updated 3 Bed Condo in Santa Clara 2601 Cortez Dr #1205, Santa Clara, CA 95051 $2,995/mo KEY FEATURES Sq Footage: 974 sqft. Bedrooms: 3 Beds Bathrooms: 2 Baths Parking: 2 Other Lease Duration: 1 Year Deposit: $2,995 Pets Policy: No Pets Allowed Laundry: In Unit Property Type: Condo DESCRIPTION Light and bright Top Floor Condo in the heart of Silicon Valley! The updated kitchen and baths have granite counter-tops, tile back-splashes, tile floors, and maple cabinetry! Some of the other touches include crown moldings, wall-to-wall carpeting, air conditioning, wall furnaces, in-unit laundry, ceiling fans, and 2 car-parking. Centrally located in Santa Clara, you are minutes away from HWY 101, the Lawrence CalTrain Station, and other public transportation. Also, you will be walking distance to Bracher Elementary school and Bracher Park, with walking paths, a grass field, BBQ, and a playground. There are plenty of restaurants, shopping, and retail around, and the newly being constructed Santa Clara Square, which is minutes away, will house a new Whole Foods Market along with new restaurants! This spectacular unit has so much to offer, come and see for yourself! You will not find a better value for a 3-bedroom in Santa Clara! Optionally furnished for an additional $150 per month RENTAL FEATURES Range / Oven Refrigerator Dishwasher Microwave Stainless steel appliances Heat: forced air Central A/C High-speed internet Tile floor Granite countertop COMMUNITY FEATURES Covered parking Contact info: OneRent show contact info","cats_s":"true","street_address_s":"2601 Cortez Dr Unit 1205","page_url_s":"http://sfbay.craigslist.org/sby/apa/5605312822.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available may 26","title_s":"Updated 3 Bed Condo in Santa Clara","neighborhood_s":"santa clara","dogs_s":"true","housetype_s":"condo"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00q0q_b3OYUi1AUku_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%33%32%38+East+Eaglewood+Drive+Sunnyvale+CA+US","subarea_s":"south bay","laundry_s":"false","price_s":"$3500","sqft_s":"1148","postid_s":"5607510143","datetime_s":"2016-05-27 4:47pm 2016-05-27 4:47pm 2016-05-31 2:56pm","bodytext_s":"3 Bedroom, 2 Bathroom Single Story House1-Car attached GarageLiving room has a fireplaceKitchen comes with a Gas Stove, Refrigerator, Microwave, Disposal and DishwasherWasher & Dryer HOOK UP's in Garage NO PETS ! NO SMOKING! Please drive by first then contact our office at show contact info to make an appointment to see inside. Check out all of our rentals on our website at http://www.hillandcorealtors.com DRE 01060930 ??? Schools listed subject to District Availability! ??? We have 24 Hour Maintenance on call","street_address_s":"328 East Eaglewood Drive","page_url_s":"http://sfbay.craigslist.org/sby/apa/5607510143.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available jul 04","title_s":"3 Bedroom 2 Bathroom House ( 328 E. Eaglewood Drive )","neighborhood_s":"sunnyvale","housetype_s":"house"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00k0k_56fivWLdM8n_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%31%31%33+Sondgroth+Way+Mountain+View+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$3900","sqft_s":"1292","postid_s":"5600271050","datetime_s":"2016-05-23 9:57am 2016-05-23 9:57am 2016-05-31 2:56pm","bodytext_s":"3 Bedroom, 3 Bathroom TOWNHOUSE 3 Levels with a 1-Car attached Garage Central Heat & Air conditioning Separate dining room and living room has Fireplace Kitchen comes with a Gas Stove, Microwave, Refrigerator, Disposal and Dishwasher WASHER & DRYER INCLUDED Covington Elementary***Egan Jr. High***Los Altos High 113 Sondgroth Way, Mountain View, CA 94040 NO PETS ! NO SMOKING INSIDE ! Please drive by first then contact our office at show contact info to make an appointment to see inside. Check out all of our rentals on our website at http://www.hillandcorealtors.com DRE 01060930 â???¢ Schools listed subject to District Availability! â???¢ We have 24 Hour Maintenance on call","street_address_s":"113 Sondgroth Way","page_url_s":"http://sfbay.craigslist.org/sby/apa/5600271050.html","category_s":"apts/housing for rent","bathroom_s":"3","parking_s":"true","available_s":"available jun 01","title_s":"3 Bedroom/3 Bath TOWNHOUSE ( 113 Sondgroth Way )","neighborhood_s":"mountain view","housetype_s":"townhouse"},
{"wheelchair_s":"true","bedroom_s":"1","image_src_s":"http://images.craigslist.org/00s0s_3KltWHUIZR7_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%31%37%32%35+S%2E+Bascom+Avenue+Campbell+CA+US","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$2950","sqft_s":"839","postid_s":"5613230342","datetime_s":"2016-05-31 3:17pm 2016-05-31 3:17pm","bodytext_s":"Revere Campbell, managed by Berkshire Communities 1725 S. Bascom Avenue Campbell, CA 95008 show contact info Enjoy everything Campbell has to offer. Walk next door to the movies, grab a bite across the street, or enjoy a stroll through the farmers market on Sundays. Revere has it all. Large bedroom has patio space, walk in closet, washer and dryer area and more. This apartment requires a $500 deposit. VIEW OUR WEBSITE: http://www.reverecampbell.com [#2561670]","cats_s":"true","street_address_s":"1725 S. Bascom Avenue","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613230342.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available may 30","title_s":"Intelligent Design and Modern Flavor complete this 1 bedroom","neighborhood_s":"campbell","dogs_s":"true","housetype_s":"apartment"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/00X0X_94wo9RtOZWf_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%34%35%35+Clifton+Ave+san+jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$2700","sqft_s":"1500","postid_s":"5605284334","datetime_s":"2016-05-26 10:10am 2016-05-26 10:10am 2016-05-31 2:56pm","bodytext_s":"Contact info: OneRent | show contact info Impressive and Lovely Home in Ideal San Jose Location. 455 Clifton Ave, San Jose, CA 95128 $2,700/mo KEY FEATURES Sq Footage: 1500 sqft. Bedrooms: 2 Beds Bathrooms: 1 Bath Parking: None Lease Duration: 1 Year Deposit: $2,700 Pets Policy: Cats & Dogs OK Laundry: In Unit Property Type: Townhouse DESCRIPTION Impeccably renovated 2 bed home in quiet duplex, ideally situated in a great area of San Jose. Features 2 well appointed bedrooms, 2 nice contemporary bathrooms, and approximately 1,500 square feet. Magnificent home equipped with incredibly spacious, bright, and lovely rooms throughout. Updated kitchen with granite counters and equipped with newer appliances. Top of the line appliances including refrigerator, oven, and dish washer. A spacious formal living room with built-ins, light filled and inviting family room with over sized windows. A perfect San Jose location offering easy access to Downtown. Parking for two cars. Just short distance to Hwy 280/880, and all major routes. Nearby great shopping, entertainment, restaurants, and parks. Basement room for storage and laundry. RENTAL FEATURES Range / Oven Refrigerator Dishwasher Balcony, Deck, or Patio High-speed internet Tile floor Granite countertop Contact info: OneRent show contact info","cats_s":"true","street_address_s":"455 Clifton Ave","page_url_s":"http://sfbay.craigslist.org/sby/apa/5605284334.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available may 26","title_s":"Impressive and Lovely Home in Ideal San Jose Location.","neighborhood_s":"san jose","dogs_s":"true","housetype_s":"townhouse"},
{"bedroom_s":"4","image_src_s":"http://images.craigslist.org/00909_54IWpdFqk3C_600x450.jpg","google_maps_link_s":"https://maps.google.com/maps/preview/@37.135300,-121.650100,16z","subarea_s":"south bay","price_s":"$3650","sqft_s":"3339","postid_s":"5613132369","datetime_s":"2016-05-31 2:17pm 2016-05-31 2:17pm","bodytext_s":"zip code 95037 This house is a lease with option to buy property and is located near sunnyside ave and sycamore dr, must have proof of income to get in, no credit checks needed, call for listings and more info office hours 7:00am-6:00pm","cats_s":"true","street_address_s":"","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613132369.html","category_s":"apts/housing for rent","bathroom_s":"3","available_s":"available may 31","title_s":"Amazing home in morgan hill","neighborhood_s":"morgan hill","dogs_s":"true","housetype_s":"house"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/01515_eIfPT2egF6x_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%36%35%37+Grand+Fir+Ave+Sunnyvale+CA+US","subarea_s":"south bay","price_s":"$2400","sqft_s":"900","postid_s":"5583029201","datetime_s":"2016-05-12 12:31pm 2016-05-12 12:31pm 2016-05-31 2:55pm","bodytext_s":"2 Bedroom / 1 Bathroom UPSTAIRS Apartment Kitchen is completely remodeled New paint and carpet 1-Assigned Car Port Spot Coin-Op Laundry on site 24-hrs maintenance service on call NO SMOKING!!! NO PETS!!! Please drive by first, then contact our office, show contact info to make an appointment to view inside. Hill & Co. Realtors CalBRE01060930 See all our listings at www.hillandcorealtors.com","street_address_s":"657 Grand Fir Ave","page_url_s":"http://sfbay.craigslist.org/sby/apa/5583029201.html","category_s":"apts/housing for rent","bathroom_s":"1","available_s":"available may 16","title_s":"2 Bed - 1 Bath UPSTAIRS Apartment ( 657 Grand Fir Ave. # 4 )","neighborhood_s":"sunnyvale","housetype_s":"apartment"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/00K0K_7WBZ9z7XUoF_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%32%32%35%35+Showers+Drive+Mountain+View+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$2700","sqft_s":"769","postid_s":"5584683835","datetime_s":"2016-05-13 12:36pm 2016-05-13 12:36pm 2016-05-31 2:55pm","bodytext_s":"2 Bedroom, 1 Bathroom Single Story, bottom floor Condo Fresh PaintNEXT TO POOL1 Assigned underground parkingKitchen comes with an Electric Stove, Refrigerator, Dishwasher and DisposalWASHER & DRYER IN UNITNext to Cal Train, Whole Foods and 24 hour fitness Schools: Hoover Elementary/ Egan Jr. High/ Los Altos High NO PETS ! NO SMOKING! Please drive by first then contact our office at show contact info to make an appointment to see inside. Check out all of our rentals on our website at http://www.hillandcorealtors.com Cal BRE 01060930 • Schools listed subject to District Availability! • We have 24 Hour Maintenance on call","street_address_s":"2255 Showers Drive","page_url_s":"http://sfbay.craigslist.org/sby/apa/5584683835.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available may 16","title_s":"2 Bedroom, 1 Bath Townhouse Next to Cal Train ( 2255 Showers Dr. # 143","neighborhood_s":"mountain view","housetype_s":"condo"},
{"bedroom_s":"1","image_src_s":"http://images.craigslist.org/00H0H_7evgvwKVZXb_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+Misson+Blvd+Fremont+CA+US","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$1900","postid_s":"5578843549","datetime_s":"2016-05-10 2:12am 2016-05-10 2:12am 2016-05-31 2:54pm","bodytext_s":"**Please tell us a bit about you, profession, reason of moving, and preferred lease terms.** $1900 -- Brand New Cozy Studio -- Utilities Included -- MSJ great school district in Fremont --Walking distance to Tech companies (Google/Facebook/Apple) shuttles Unit Features: Brand new cottage studio + extra storage + washer & dryer. Available now. * Bright and sunny studio in a separate building. * Excellent privacy. No upstairs/downstairs neighbors or shared walls. * Washer & dryer and extra storage for yourself. * One block away from Fremont Mission Blvd & 680 Park & Ride where many Silicon Valley company shuttles have a stop * Quiet and safe Mission San Jose neighborhood in Fremont. * Furnished or not: your choice Amenities: * Luxury new building: you will be the first one to live in it! * Brand new A/C and heat * Brand new small kitchen with granite countertop and a small stainless steel refrigerator * Dedicated washer & dryer downstairs (not shared) * Brand new carpet/tiles throughout * Dual-pane windows * Utilities (gas, electricity, water, and garbage), gardening and Internet are included. * Furnitures may be included if you prefer. Convenience: * Commuters' dream: one block away from Fremont Mission Blvd & 680 Park & Ride where many Silicon Valley companies provide shuttles to offices. * Walk to the highly desirable top schools: Mission San Jose High School; Hopkins Junior High; and Chadbourne Elementary. * Walk to the Mission creek trails, restaurants, fitness center, McDonald's, CVS, etc. * Close to Ohlone College (1.0 mile) * Easy access to Fremont BART station - only 9 minutes away (3.6 mile). * Minutes to Highway 680, 238, 880, 237 Rent: $1900/month, 1 year lease. May be furnished with furnitures (same rent, additional deposit may apply). Security Deposit: $1,900, must have good credit. Utilities (gas, electricity, water, and garbage) and Internet are included. Availability: Now. Please tell us a bit about you, profession, reason of moving, and preferred lease terms. Good credit is a must and prior landlord reference will be verified. Sorry, no pets, no drugs, and no smoking please. No section 8.","street_address_s":"Misson Blvd","page_url_s":"http://sfbay.craigslist.org/sby/apa/5578843549.html","category_s":"apts/housing for rent","bathroom_s":"1","available_s":"available may 10","title_s":"Brand New Studio --MSJ Fremont --Walking dist to Tech company shuttles","furnished_s":"true","neighborhood_s":"Fremont","housetype_s":"cottage/cabin"},
{"bedroom_s":"4","image_src_s":"http://images.craigslist.org/00R0R_lJViMEgrGld_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%37%35%38%31+Bollinger+Road+Cupertino+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$4500","sqft_s":"1728","postid_s":"5607515599","datetime_s":"2016-05-27 4:52pm 2016-05-27 4:52pm 2016-05-31 2:55pm","bodytext_s":"4 Bedrooms, 2 Bathroom Single Story HOUSE at the end of a dead end street, VERY LITTLE TRAFFIC 1728 Square Feet 2-Car Garage Living room & Family room both have wood burning FIREPLACE and HARDWOOD FLOORS Formal Dining room with HARDWOOD FLOOR Bedrooms have carpet Kitchen comes with an Electric Stove, Refrigerator, Dishwasher, and Disposal AIR CONDITIONING Great Landscaping comes with Gardener Washer & Dryer provided without warranty LINCOLN ELEMENTARY****LAWSON MIDDLE****MONTE VISTA HIGH NO PETS ! NO SMOKING INSIDE ! Please drive by first then contact our office at show contact info to make an appointment to see inside. Check out all of our rentals on our website at http://www.hillandcorealtors.com CalBRE 01060930 * Schools listed subject to District Availability!","street_address_s":"7581 Bollinger Road","page_url_s":"http://sfbay.craigslist.org/sby/apa/5607515599.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available jul 04","title_s":"2 Bath Single Story HOUSE ( 7581 Bollinger Road )","neighborhood_s":"cupertino","housetype_s":"apartment"},
{"bedroom_s":"5","image_src_s":"http://images.craigslist.org/00Q0Q_86XIbkBxHxd_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%32%30%38%38%39+Greenleaf+Dr+Cupertino+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$6500","sqft_s":"3296","postid_s":"5607526889","datetime_s":"2016-05-27 5:01pm 2016-05-27 5:01pm 2016-05-31 2:55pm","bodytext_s":"PHOTOS COMING SOON!!!5 Bedroom, 3.5 Bathroom Two-Story House with a 3-Car GarageHigh CeilingsLarge Master Suite and a full bedroom/bathroom on first floor as wellPlush Carpet and Wood flooringDual Air Condition for both levelsLarge Yard that comes with GardenerBuilt in 1997Fully equipped kitchen and WASHER & DRYER INCLUDEDCupertino Schools: GARDEN GATE ELEMENTARY***LAWSON MIDDLE***MONTA VISTA HIGH***NO PETS ! NO SMOKING! Please drive by first then contact our office at show contact info to make an appointment to see inside. Check out all of our rentals on our website at http://www.hillandcorealtors.com Cal BRE 01060930 ??? Schools listed subject to District Availability! ??? We have 24 Hour Maintenance on call","street_address_s":"20889 Greenleaf Dr","page_url_s":"http://sfbay.craigslist.org/sby/apa/5607526889.html","category_s":"apts/housing for rent","bathroom_s":"3.5","parking_s":"true","available_s":"available jul 01","title_s":"Executive 5 Bedroom Home in Cupertino ( 20889 Greneleaf Drive )","neighborhood_s":"cupertino","housetype_s":"house"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00v0v_3XXW2yb0VIO_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%35%36+S+%31%36th+St+san+jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$3650","sqft_s":"1707","postid_s":"5605167868","datetime_s":"2016-05-26 9:08am 2016-05-26 9:08am 2016-05-31 2:55pm","bodytext_s":"Contact info: OneRent | show contact info Beautiful Home in Naglee Park 56 S 16th St, San Jose, CA 95112 $3,650/mo KEY FEATURES Sq Footage: 1707 sqft. Bedrooms: 3 Beds Bathrooms: 2.5 Baths Parking: None Lease Duration: 1 Year Deposit: $3,650 Pets Policy: No Pets Allowed Laundry: In Unit Property Type: Single Family House DESCRIPTION Beautiful single family home with new stainless steel appliances, granite counters, fireplace, and central heat/AC. Enjoy the newly landscaped backyard with fruit trees. Located in the historic Naglee Park neighborhood, you're minutes from most hwys 101/880/280/87/680/85, shopping and dining in Downtown San Jose. Kid's Playarea in community. RENTAL FEATURES Range / Oven Refrigerator Dishwasher Stainless steel appliances Fenced yard Heat: forced air Central A/C High-speed internet Granite countertop Fireplace Contact info: OneRent show contact info","street_address_s":"56 S 16th St","page_url_s":"http://sfbay.craigslist.org/sby/apa/5605167868.html","category_s":"apts/housing for rent","bathroom_s":"2.5","parking_s":"true","available_s":"available may 26","title_s":"Beautiful Home in Naglee Park","neighborhood_s":"san jose","housetype_s":"house"},
{"bedroom_s":"1","image_src_s":"http://images.craigslist.org/00f0f_ar5par8YoZ1_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%38%34%37+W+California+Ave+sunnyvale+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$2295","sqft_s":"585","postid_s":"5605136566","datetime_s":"2016-05-26 8:51am 2016-05-26 8:51am 2016-05-31 2:55pm","bodytext_s":"Contact info: OneRent | show contact info 1Bd/1Ba Condo 847 W California Ave J, Sunnyvale, CA 94086 $2,295/mo KEY FEATURES Sq Footage: 585 sqft. Bedrooms: 1 Bed Bathrooms: 1 Bath Parking: None Lease Duration: 1 Year Deposit: $2,500 Pets Policy: Cats & Dogs OK Laundry: In Unit Property Type: Condo RENTAL FEATURES Range / Oven Refrigerator Dishwasher Garbage disposal Balcony, Deck, or Patio Heat: forced air Ceiling fans Contact info: OneRent show contact info","cats_s":"true","street_address_s":"847 W California Ave","page_url_s":"http://sfbay.craigslist.org/sby/apa/5605136566.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available may 26","title_s":"Stunning Light-Filled Condo in a Prestine Complex","neighborhood_s":"sunnyvale","dogs_s":"true","housetype_s":"condo"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00E0E_5fpBE72I2mk_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%39%39%39+Glenbar+Ave+sunnyvale+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$4000","sqft_s":"1524","postid_s":"5605148501","datetime_s":"2016-05-26 8:57am 2016-05-26 8:57am 2016-05-31 2:54pm","bodytext_s":"Contact info: OneRent | show contact info Fabulous 3 Bedroom Home with Amazing Modern Upgrades 999 Glenbar Ave, Sunnyvale, CA 94087 $4,000/mo KEY FEATURES Sq Footage: 1524 sqft. Bedrooms: 3 Beds Bathrooms: 2 Baths Parking: None Lease Duration: 1 Year Deposit: $4,000 Pets Policy: No Pets Allowed Laundry: In Unit Property Type: Single Family House DESCRIPTION Light-filled rooms and tasteful upgrades welcome you, while the home's spacious open floor layout provides comfortable living for everyone. Featuring 3 spacious bedrooms, and 2 full baths. This stunning home has been extensively updated with a delightful blend of architectural details and modern amenities. Impressive upgrades include fresh interior and exterior paint, newer roof, remodeled gourmet kitchen with granite slab counters, and newer stainless appliances, gleaming hardwood flooring throughout, newer furnace and central A/C and heat, and a sun room with endless possibilities. Conveniently located next to Raynor park. Just walking distance to many top schools include Laurelwood, Peterson Middle, Wilcox High, and and new Apple Spaceship Campus. RENTAL FEATURES Sun room Range / Oven Refrigerator Dishwasher Microwave Stainless steel appliances Fenced yard Lawn Sprinkler system Heat: forced air Central A/C Hardwood floor Tile floor Granite countertop Fireplace Skylights Contact info: OneRent show contact info","street_address_s":"999 Glenbar Ave","page_url_s":"http://sfbay.craigslist.org/sby/apa/5605148501.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available may 26","title_s":"Fabulous 3 Bedroom Home with Amazing Modern Upgrades","neighborhood_s":"sunnyvale","housetype_s":"house"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/00w0w_5ZU9zxzLtv3_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%31%38%38%33+Agnew+Rd+Santa+Clara+CA+US","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$2950","sqft_s":"1070","postid_s":"5607044207","datetime_s":"2016-05-27 11:50am 2016-05-27 11:50am 2016-05-31 3:23pm","bodytext_s":"About the Condo: - Complex is Mission Terrace, located at 1883 Agnew Rd, Santa Clara, CA, in highly desirable Rivermark center - Unit is 2 bed/ 2 bath 1070 sq ft - This is an end unit with only 2 walls common. No one lives below it so you do not need to worry about downstairs neighbors complaining about heavy footsteps. - Private Patio faces the swimming pool and is away from any street or railway track noise - The condo comes with Refrigerator, Dish Washer, Microwave, Garbage disposal in kitchen sink, maple cabinets with cherry finish, granite slab countertops, washer/dryer - Master suite has a walk in closet, dual vanity with granite countertop, tile floors, two tone paints accent walls. - Efficient electric central air heating system with air-conditioning - Cable Ready. - Great location: minutes away from parks, many tech companies, Levis stadium, shopping center etc - Don Callejon school - Gated Community with dial in access to the premises. 2 designated parking spaces @ underground parking garage - Patrolled security - The complex has a wonderful common area with a pool, picnic areas, gym, play area for kids, etc. Desired Tenant: - Stable income/ able to pay rent/ bills on time - Rent: $2950 (for 12 month lease) - Deposit: $3000 - No Pet, No Smoke - Move in date: available now If interested, please contact me at show contact info","street_address_s":"1883 Agnew Rd","page_url_s":"http://sfbay.craigslist.org/sby/apa/5607044207.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available may 29","title_s":"RENT 2 Bed/2 Bath 1070 sqft luxury condo in Rivermark !!","neighborhood_s":"santa clara","housetype_s":"apartment"},
{"bedroom_s":"1","image_src_s":"http://images.craigslist.org/00202_7l8aST3lnWk_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%33%33%34+Santana+Row+San+Jose+CA+US","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$2995","sqft_s":"736","postid_s":"5613201324","datetime_s":"2016-05-31 2:58pm 2016-05-31 2:58pm","bodytext_s":"1 Bedroom Unit Over Looking Santana Row Property Address 334 Santana Row, Unit#243 | San Jose, CA 95128 Offered By GS Property Management, Inc.  |  show contact info Description Welcome to this 1 bedroom unit in the Margo Building overlooking Santana Row. This unit features hardwood floors, granite counter tops, gas range, built in microwave hood, dishwasher, garbage disposal, in-door laundry, and two underground parking spaces. **Showing appointments scheduled by phone only.** Centrally located on Santana Row near shopping, restaurants, movie theaters, and easy access to highways 880, 17, 280 and 101. *** After application approval, HOA requires two week notification PRIOR to move-in*** Details Beds/Baths: 1BD/1.0BA Square Feet: 736 Rental Terms Rent: $2,995.00 Application Fee: $35.00 Security Deposit: $2,995.00","street_address_s":"334 Santana Row","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613201324.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available may 31","title_s":"1 Bedroom Unit Over Looking Santana Row","neighborhood_s":"san jose west","housetype_s":"condo"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/00f0f_jjt0Es5rr6G_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%32%35%30+W%2E+El+Camino+Real+Sunnyvale+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$3975","sqft_s":"1059","postid_s":"5613185639","datetime_s":"2016-05-31 2:49pm 2016-05-31 2:49pm","bodytext_s":"VIEW OUR WEBSITE: http://www.irvinecompanyapartments.com/communities/cherry-orchard Cherry Orchard , managed by The Irvine Company 250 West El Camino Real Sunnyvale, CA 94087 show contact info Newly remodeled homes include gourmet kitchens with granite countertops, stainless steel gas appliances, tile flooring, cherry-wood kitchen cabinets, and in home washer and dryer. Contemporary two bedroom, two bathroom apartment featuring spacious storage, private deck and in-home laundry. Monday 9:00am - 6:00pm Tuesday 9:00am - 7:00pm Wednesday 9:00am - 6:00pm Thursday 9:00am - 5:00pm Friday 9:00am - 6:00pm Saturday 9:00am - 6:00pm Sunday 12:00pm - 6:00pm Apartment Features * Full sized Washer and Dryer in unit * Fireplace * Granite Countertops * Private Patio or Private Balcony (on select apartments) * Walk-in Closet * Stainless Steel Appliances * Air Conditioning [#2565388]","cats_s":"true","street_address_s":"250 W. El Camino Real","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613185639.html","category_s":"apts/housing for rent","bathroom_s":"2","available_s":"available may 31","title_s":"Dog Park, Gourmet Kitchen, Contemporary Design","neighborhood_s":"sunnyvale","dogs_s":"true","housetype_s":"apartment"},
{"bedroom_s":"2","image_src_s":"","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%32%30%34%35+Foxworthy+Ave+san+jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$3100","sqft_s":"800","postid_s":"5605067990","datetime_s":"2016-05-26 8:14am 2016-05-26 8:14am 2016-05-31 2:53pm","bodytext_s":"Contact info: OneRent | show contact info 2Bd/1Ba Townhouse 2045 Foxworthy Ave, San Jose, CA 95124 $3,100/mo KEY FEATURES Sq Footage: 800 sqft. Bedrooms: 2 Beds Bathrooms: 1 Bath Parking: None Lease Duration: 1 Year Deposit: $3,400 Pets Policy: Cats OK Laundry: In Unit Property Type: Townhouse RENTAL FEATURES Living room Storage space Refrigerator Dishwasher Microwave Garbage disposal Freezer Balcony, Deck, or Patio Lawn Garden Sprinkler system Heat: forced air Air conditioning Double pane / Storm windows Hardwood floor Contact info: OneRent show contact info","cats_s":"true","street_address_s":"2045 Foxworthy Ave","page_url_s":"http://sfbay.craigslist.org/sby/apa/5605067990.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available may 26","title_s":"Dream Townhouse With 2/1,Cats ok","neighborhood_s":"san jose","housetype_s":"townhouse"},
{"bedroom_s":"2","image_src_s":"","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%33%35%30+North+%32nd+Street+san+jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$3450","sqft_s":"1667","postid_s":"5568686496","datetime_s":"2016-05-03 11:07am 2016-05-03 11:07am 2016-05-31 2:52pm","bodytext_s":"Contact info: Dylan Trujillo | OneRent | show contact info Luxury Condo in Downtown San Jose! 350 N 2nd St #137, San Jose, CA 95112 $3,750/mo KEY FEATURES Sq Footage: 1667 sqft. Bedrooms: 2 Beds Bathrooms: 3 Baths Parking: 2 Other Lease Duration: 1 Year Deposit: $3,750 Pets Policy: Cats & Dogs OK Laundry: In Unit Property Type: Single Family House DESCRIPTION Pristine 3 Story Condo in downtown San Jose! This spacious, loft style home includes 2 bedrooms, 3 bathrooms, plus a fully enclosed office with 100 megabit upload and download fiber optic internet connection included in the rent. New washer/dryer and custom closets. Community gym, cardio, hot tub and swimming pool! Secured building, just walking distance from San Pedro Square and Japantown. Nearby shopping centers include Wholefoods and Trader Joes (1 mile). One block from light rail. Ready for showing starting May 1st! Water, garbage, sewage, and internet included. 2 assigned parking spaces. RENTAL FEATURES Living room Walk-in closet Master bath Family room Storage space Office Range / Oven Refrigerator Dishwasher Microwave Garbage disposal Stainless steel appliances Freezer Balcony, Deck, or Patio Heat: forced air Central A/C Ceiling fans Double pane / Storm windows Cable-ready High-speed internet Wired Hardwood floor Fireplace High / Vaulted ceiling COMMUNITY FEATURES Elevator Secured entry Controlled access Gated entry Security system Disability access Covered parking Contact info: Dylan Trujillo OneRent show contact info","cats_s":"true","street_address_s":"350 North 2nd Street","page_url_s":"http://sfbay.craigslist.org/sby/apa/5568686496.html","category_s":"apts/housing for rent","bathroom_s":"3","available_s":"available may 03","title_s":"Luxury Condo in Downtown San Jose!","neighborhood_s":"san jose","dogs_s":"true","housetype_s":"house"},
{"bedroom_s":"1","image_src_s":"http://images.craigslist.org/01414_gMefZCCKehN_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%33%30%31%34+Huff+Ave%2E+San+Jose+CA+US","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$1775","sqft_s":"600","postid_s":"5613198346","datetime_s":"2016-05-31 2:57pm 2016-05-31 2:57pm","bodytext_s":"Beautiful and sunny 1 bedroom, 1 bathroom apartment available NOW! Located near Santana Row, major transportation and easy access to freeways (but without the traffic noise!). Located on the second floor of a 12 unit building, this spacious apartment has been fully remodeled. It has a new kitchen, new bathroom and new windows. Kitchen features granite countertops with newer appliances. Laundry is located in the building and parking is included (with extra storage locker). Apartment is cable ready! Landlord pays for water, sewer, trash; tenant pays for PG&E for apartment and cable. This is a lovely apartment in a quiet building. Requirements: ** $25 application fee per adult (>18 years old) ** No pets ** No smoking ** 1 year lease ** $1,000 security deposit If interested, please contact Caroline to schedule an appointment. Hurry, this apartment won't last!!!","street_address_s":"3014 Huff Ave.","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613198346.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available jun 01","title_s":"1 Bed/1 Bath - REMODELED! BRIGHT & SUNNY! GREAT LOCATION!","neighborhood_s":"san jose west","housetype_s":"apartment"},
{"bedroom_s":"2","image_src_s":"","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%31%38%30%30+Bevin+Brook+Dr+san+jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$2300","sqft_s":"984","postid_s":"5590589714","datetime_s":"2016-05-17 8:47am 2016-05-17 8:47am 2016-05-31 2:51pm","bodytext_s":"Contact info: OneRent | show contact info 2Bd/2Ba Condo 1800 Bevin Brook Dr #1800, San Jose, CA 95112 $2,300/mo KEY FEATURES Sq Footage: 984 sqft. Bedrooms: 2 Beds Bathrooms: 2 Baths Parking: None Lease Duration: 1 Year Deposit: $2,300 Pets Policy: No Pets Allowed Laundry: In Unit Property Type: Condo RENTAL FEATURES Range / Oven Refrigerator Dishwasher Microwave Garbage disposal Heat: forced air Central A/C Contact info: OneRent show contact info","street_address_s":"1800 Bevin Brook Dr","page_url_s":"http://sfbay.craigslist.org/sby/apa/5590589714.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available may 17","title_s":"Modern living in this Gorgeous place at san jose","neighborhood_s":"san jose","housetype_s":"condo"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00M0M_53R8fkAF47I_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%38%38%31+Towne+Dr+milpitas+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$3250","sqft_s":"1404","postid_s":"5572167654","datetime_s":"2016-05-05 1:12pm 2016-05-05 1:12pm 2016-05-31 2:51pm","bodytext_s":"Contact info: OneRent | show contact info 3Bd/3.5Ba Single Family House 881 Towne Dr, Milpitas, CA 95035 $3,350/mo KEY FEATURES Sq Footage: 1404 sqft. Bedrooms: 3 Beds Bathrooms: 3.5 Baths Parking: None Lease Duration: 1 Year Deposit: $3,350 Pets Policy: Cats & Dogs OK Laundry: In Unit Property Type: Single Family House RENTAL FEATURES Living room Dining room Walk-in closet Master bath Pantry Range / Oven Refrigerator Dishwasher Microwave Garbage disposal Balcony, Deck, or Patio Heat: forced air Central A/C Double pane / Storm windows Fireplace Contact info: OneRent show contact info","cats_s":"true","street_address_s":"881 Towne Dr","page_url_s":"http://sfbay.craigslist.org/sby/apa/5572167654.html","category_s":"apts/housing for rent","bathroom_s":"3.5","parking_s":"true","available_s":"available may 05","title_s":"Magnificent Home with Lots of Stunning Features","neighborhood_s":"milpitas","dogs_s":"true","housetype_s":"house"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/00909_qRX4r0UjwB_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%33%38+N+Almaden+Blvd+san+jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$3500","sqft_s":"1275","postid_s":"5581515051","datetime_s":"2016-05-11 1:45pm 2016-05-11 1:45pm 2016-05-31 2:50pm","bodytext_s":"Contact info: OneRent | show contact info Live in Luxury in the Gorgeous Downtown Condo 38 N Almaden Blvd #1301, San Jose, CA 95110 $3,545/mo KEY FEATURES Sq Footage: 1275 sqft. Bedrooms: 2 Beds Bathrooms: 2 Baths Parking: 2 Garage Lease Duration: 1 Year Deposit: $3,545 Pets Policy: Cats & Dogs OK Laundry: In Unit Property Type: Condo DESCRIPTION Beautiful centrally located condo. Close to schools, shopping, parks and freeways. Featuring two generous sized master bedrooms, two modern bathrooms, and approximately 1,275 square feet of living area with fireplace and incredible view! Comfortable, bright, open flow with balcony/patio. A formal dining area near kitchen. It also offers amazing hardwood floors through out, high ceilings making it more elegant, central air conditioning, a gourmet kitchen with plenty of cabinet space and comes with newer stainless steel appliances. Lots of guest parking in the complex. Amenities include nice fitness center and barbecue area. Plus, there is a shared pool perfect for summer and 2 car attached garage as well. Walking distance from SAP center. With ease access to anything in Downtown San Jose. Owner is leaving flat screen TV and sound system. RENTAL FEATURES Master bath Range / Oven Refrigerator Dishwasher Microwave Garbage disposal Stainless steel appliances Balcony, Deck, or Patio Heat: forced air Central A/C Cable-ready High-speed internet Hardwood floor COMMUNITY FEATURES Secured entry Covered parking Garage - Attached Garage - Detached Contact info: OneRent show contact info","cats_s":"true","street_address_s":"38 N Almaden Blvd","page_url_s":"http://sfbay.craigslist.org/sby/apa/5581515051.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available may 11","title_s":"Live in Luxury in the Gorgeous Downtown Condo","neighborhood_s":"san jose","dogs_s":"true","housetype_s":"condo"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00e0e_cqNNtw6L4ZC_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%32%36%30%31+Cortez+Dr+Unit+%31%32%30%35+santa+clara+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$2995","sqft_s":"974","postid_s":"5590878869","datetime_s":"2016-05-17 11:10am 2016-05-17 11:10am 2016-05-31 2:50pm","bodytext_s":"Contact info: OneRent | show contact info Updated 3 Bed Condo in Santa Clara 2601 Cortez Dr #1205, Santa Clara, CA 95051 $2,995/mo KEY FEATURES Sq Footage: 974 sqft. Bedrooms: 3 Beds Bathrooms: 2 Baths Parking: 2 Other Lease Duration: 1 Year Deposit: $2,995 Pets Policy: No Pets Allowed Laundry: In Unit Property Type: Condo DESCRIPTION Light and bright Top Floor Condo in the heart of Silicon Valley! The updated kitchen and baths have granite counter-tops, tile back-splashes, tile floors, and maple cabinetry! Some of the other touches include crown moldings, wall-to-wall carpeting, air conditioning, wall furnaces, in-unit laundry, ceiling fans, and 2 car-parking. Centrally located in Santa Clara, you are minutes away from HWY 101, the Lawrence CalTrain Station, and other public transportation. Also, you will be walking distance to Bracher Elementary school and Bracher Park, with walking paths, a grass field, BBQ, and a playground. There are plenty of restaurants, shopping, and retail around, and the newly being constructed Santa Clara Square, which is minutes away, will house a new Whole Foods Market along with new restaurants! This spectacular unit has so much to offer, come and see for yourself! You will not find a better value for a 3-bedroom in Santa Clara! Optionally furnished for an additional $150 per month RENTAL FEATURES Range / Oven Refrigerator Dishwasher Microwave Stainless steel appliances Heat: forced air Central A/C High-speed internet Tile floor Granite countertop COMMUNITY FEATURES Covered parking Contact info: OneRent show contact info","cats_s":"true","street_address_s":"2601 Cortez Dr Unit 1205","page_url_s":"http://sfbay.craigslist.org/sby/apa/5590878869.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available may 17","title_s":"Updated 3 Bed Condo in Santa Clara","neighborhood_s":"santa clara","dogs_s":"true","housetype_s":"condo"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00r0r_hlNg8pSmhcX_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%31%32%30%36+Weepinggate+Ln+san+jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$2850","sqft_s":"1296","postid_s":"5590865760","datetime_s":"2016-05-17 11:04am 2016-05-17 11:04am 2016-05-31 2:50pm","bodytext_s":"Contact info: OneRent | show contact info Fantastic 3 Bedroom Condo in Ideal Location. 1206 Weepinggate Ln, San Jose, CA 95136 $2,850/mo KEY FEATURES Sq Footage: 1296 sqft. Bedrooms: 3 Beds Bathrooms: 1.5 Baths Parking: None Lease Duration: 1 Year Deposit: $2,850 Pets Policy: Cats & Dogs OK Laundry: In Unit Property Type: Condo DESCRIPTION Fantastic condo situated in great Edenvale neighborhood. Featuring 3 huge bedrooms, 1.5 nice baths, and roughly about 1,296 square feet of living space. This classic beauty is both dazzling and inviting. Ideally suited for both entertaining and privacy. An elegant home offering luxurious comfort in every room. The open floor plan features spacious living, dining, and sun rooms. A tastefully updated kitchen featuring newer stainless steel appliances such as refrigerator, oven, dish washer, and trash compactor. This home also comes with a fenced yard and plenty of room to relax and enjoy family time. Some of the excellent amenities includes forced air, high speed internet and other utilities ready, in-unit laundry, plus a shared pool. Very convenient location. Close to everything. RENTAL FEATURES Range / Oven Refrigerator Dishwasher Garbage disposal Stainless steel appliances Fenced yard Heat: forced air High-speed internet Hardwood floor Fireplace Contact info: OneRent show contact info","cats_s":"true","street_address_s":"1206 Weepinggate Ln","page_url_s":"http://sfbay.craigslist.org/sby/apa/5590865760.html","category_s":"apts/housing for rent","bathroom_s":"1.5","parking_s":"true","available_s":"available may 17","title_s":"Fantastic 3 Bedroom Condo in Ideal Location.","neighborhood_s":"san jose","dogs_s":"true","housetype_s":"condo"},
{"bedroom_s":"0","image_src_s":"http://images.craigslist.org/00O0O_86tM4Va8gXb_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%34%32%37+S%2E+Third+Street+San+Jose+CA+US","subarea_s":"south bay","price_s":"$1450","sqft_s":"350","postid_s":"5605511895","datetime_s":"2016-05-26 12:14pm 2016-05-26 12:14pm 2016-05-31 3:12pm","bodytext_s":"CONTACT INFO Armida Flores show contact info $1450.00 STUDIO- Available NOW!!!!!OPEN HOUSE 6/1 from 2pm to 3pm - $1,450.00 per month 427 S. Third Street, San Jose , CA 95020 FEATURES Bedrooms: 0 Bathrooms: 1 Located on Floor #: 2 Square Footage: 335 Pets Allowed: None DESCRIPTION We are currently offering a cozy nice little studio near downtown San Jose.  Studio in the 2nd floor. . If you have any questions please feel free to call our office one of our team members will be happy to assist you. ***PICTURES ARE OF THE STUDIO UNIT AVAILABLE*** COMPLETELY Renovated features such as. . . - Brand new doors throughout unit -New Flooring - New finish on Counter tops - Wooden blinds - Refrigerator -Dishwasher - Oven/Stove Rent Info: Deposit: $1000.00 OAC Rent: $1450.00 Available: NOW 1 Year Lease *Utilities are not included Additional Info: Application Fee: $35 per application Refundable holding deposit of $200 to hold apartment We are sorry but we are not currently accepting Section 8 **NO Pets** Office Hours: Mon-Fri 8:00am- 5:00 pm Montebello Ridge Apartments 60 West 4th Street Ste#209 Gilroy, CA 95020 show contact info RENTAL UNIT AMENITIES Refrigerator OTHER PRICING DETAILS Available Date:   Thu Jun 30, 2016 Deposit:   1,000.00 OAC Minimum Lease:   12 Included Utilities:   NONE","street_address_s":"427 S. Third Street","page_url_s":"http://sfbay.craigslist.org/sby/apa/5605511895.html","category_s":"apts/housing for rent","bathroom_s":"Other","available_s":"available may 26","title_s":"$1450.00 STUDIO!Available NOW!","neighborhood_s":"san jose downtown","housetype_s":"apartment"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00Y0Y_7dJoEZwR4m6_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%32%37%36%33+Longford+Dr+san+jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$3645","sqft_s":"1600","postid_s":"5577406836","datetime_s":"2016-05-09 7:43am 2016-05-09 7:43am 2016-05-31 2:49pm","bodytext_s":"Contact info: OneRent | show contact info Beautiful 3 Bedroom Home with Master Suite and Upgrades 2763 Longford Dr, San Jose, CA 95132 $3,645/mo KEY FEATURES Sq Footage: 1600 sqft. Bedrooms: 3 Beds Bathrooms: 3 Baths Parking: None Lease Duration: 1 Year Deposit: $3,645 Pets Policy: No Pets Allowed Laundry: In Unit Property Type: Single Family House DESCRIPTION The home has 3 bed rooms, family room, living room and 3 full baths. The family room which has an attached bath can serve as another bed room. The home has a nice front yard in a quiet residential neighborhood. This home offers a beautiful kitchen with tile floors, and granite counter tops. Double pane windows throughout, all rooms are bright and airy. The master bedroom suite along with two other light filled bedrooms, and spacious living areas, make this a perfect home. The fended backyard contains beautiful lemon, persimmon, and pomegranate trees. Washer and Dryer are in the attached garage. The home has basic furnishing - a dining table with chairs and two sofas. 24 hour groceries (Safeway, Save mart, Local Food Groceries) and pharmacy nearby. Walkable distance to elementary school and parks. Minutes away from Great Mall, the light rail station, and the new BART station (to be opened). The home has 3 bed rooms, family room, living room and 3 full baths. The family room which has an attached bath can serve as another bed room. The home has a nice front yard in a quiet residential neighborhood. This home offers a beautiful kitchen with tile floors, and granite counter tops. Double pane windows throughout, all rooms are bright and airy. The master bedroom suite along with two other light filled bedrooms, and spacious living areas, make this a perfect home. The fended backyard contains beautiful lemon, persimmon, and pomegranate trees. Washer and Dryer are in the attached garage. The home has basic furnishing - a dining table with chairs and two sofas. 24 hour groceries (Safeway, Save mart, Local Food Groceries) and pharmacy nearby. Walkable distance to elementary school and parks. Minutes away from Great Mall, the light rail station, and the new BART station (to be opened). RENTAL FEATURES Living room Range / Oven Refrigerator Dishwasher Microwave Garbage disposal Lawn Garden Heat: forced air Central A/C Double pane / Storm windows High-speed internet Hardwood floor Tile floor Granite countertop Fireplace Skylights Contact info: OneRent show contact info","street_address_s":"2763 Longford Dr","page_url_s":"http://sfbay.craigslist.org/sby/apa/5577406836.html","category_s":"apts/housing for rent","bathroom_s":"3","parking_s":"true","available_s":"available may 09","title_s":"Beautiful 3 Bedroom Home with Master Suite and Upgrades","neighborhood_s":"san jose","housetype_s":"house"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/00U0U_hdgCM4yS5mP_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%31%32%30%31Parkmoor+Ave+San+Jose+CA+US","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$3955","sqft_s":"1594","postid_s":"5613194217","datetime_s":"2016-05-31 2:54pm 2016-05-31 2:54pm","bodytext_s":"Elements http://www.elementsapts.com CONTACT US Elements 1201 Parkmoor Avenue, San Jose, CA 95126 show contact info http://www.elementsapts.com/su/kp4k Office Hours: Mon : 9:00am - 6:00pm Tue : 9:00am - 6:00pm Wed : 9:00am - 6:00pm Thu : 9:00am - 6:00pm Fri : 9:00am - 6:00pm Sat : 9:00am - 6:00pm Sun : 9:00am - 6:00pm Take some time out of your day to check out Elements! When you get home, you deserve a little me time. Let go of stress with a dip in our pool, tone up in our fitness center, or kick back in our cinema lounge with a dozen or so friends. Live clean, green and healthy in Elements' smoke-free environment where pets are always welcome. How else could it be home? Day or night, inside or out, your experience here reflects your individuality. When home feels just right, you feel right at home. This home faces north east and is in the quietest part of our community. The large living space will allow you to enjoy your home when you need it most. Visit Elements for a tour today! FLOORPLAN: Plan 8 Sq Feet: 1594.00 Rent: $3,955.00 Deposit: $600.00 Bed/Bath: 2/2 COMMUNITY AMENITIES Executive Business Center Resident Lounge We Love Pets!* Wi-Fi in Common Areas Complete Fitness Center Professional On-Site Management Media Center Reserved Underground Parking Smoke-Free Community Electric Vehicle EV Charging Stations Resort-Inspired Pool, Spa & Sun Terrace EQUAL HOUSING OPPORTUNITY San Jose, Cat, CA, Elements, Apartment for rent, Dog","cats_s":"true","street_address_s":"1201Parkmoor Ave","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613194217.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available may 31","title_s":"Escape to your home here at Elements! Tour our Penthouse TODAY!","neighborhood_s":"san jose downtown","dogs_s":"true","housetype_s":"apartment"},
{"bedroom_s":"1","image_src_s":"http://images.craigslist.org/00U0U_2ddDcr9T5ik_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%33%31%33%31+Homestead+Road+Santa+Clara+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$2256","sqft_s":"823","postid_s":"5613194170","datetime_s":"2016-05-31 2:54pm 2016-05-31 2:54pm","bodytext_s":"Call Us Today show contact info Special Offer Save up to $500 off move-in costs The exquisite nature just outside your window is no match for what's inside your home. Our spacious floor plans offer large patios - perfect for enjoying the gorgeous scenery - fireplaces, built-in shelving, spacious closets and fully equipped kitchens with dishwashers and white cabinetry. So kick back, grab a cup of coffee and enjoy the greenery in your very own backyard at Laguna Clara Apartments. Laguna Clara","cats_s":"true","street_address_s":"3131 Homestead Road","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613194170.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available may 31","title_s":"Gorgeous 1 Bedroom 1 Bath Available Soon!","neighborhood_s":"santa clara","dogs_s":"true","housetype_s":"apartment"},
{"bedroom_s":"1","image_src_s":"http://images.craigslist.org/01111_9eGQyiAw8YS_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%37%35%30+North+King+Rd%2E+San+Jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$2135","sqft_s":"616","postid_s":"5613184171","datetime_s":"2016-05-31 2:48pm 2016-05-31 2:48pm","bodytext_s":"Make yourself at home Avenel Apartments features newly remodeled one- and two-bedroom homes with walk-in closets, vaulted ceilings and oversized patios. A walk around the community reveals ponds and fountains set among lush landscaping. Enjoy the convenient location just three miles from downtown and four miles from the San Jose International Airport. Take advantage of the nearby attractions such as the San Jose Municipal Golf Course and the Great Mall of the Bay Area. Savor the experience of living at Avenel. Call Now: show contact info Need more information? Copy this link: http://apartments.greystar.com/779801 Features - Vaulted ceilings (in select homes) - Air conditioning (wall) - Breakfast bar - Stainless Appliances - Large closets - Microwave - Dishwasher - Garbage disposal - Custom cabinetry - Separate dining area - Open layout - Granite countertops - Electric range - In-unit W&D - Vinyl plank flooring Community Amenities - Cyber Caf? - Fitness center - Pet friendly - Covered Parking - Complimentary Wi-Fi - BBQ area - Hot tub - Business center - Outdoor Pool - Clubhouse Pet Policy Avenel welcomes your pets! Additional breed restrictions, weight limits and deposits apply. Office Hours Mon - Fri: 10:00 am - 6:00 pm Saturday: 10:00 am - 5:00 pm Sunday: Closed Avenel Apartments 750 North King Road, San Jose, CA, 95133 Equal Housing Opportunity I9NPlMLZl5fZ","cats_s":"true","street_address_s":"750 North King Rd.","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613184171.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available may 31","title_s":"In-unit W&D, Granite countertops, Garbage disposal, Microwave","neighborhood_s":"san jose north","dogs_s":"true","housetype_s":"apartment"},
{"wheelchair_s":"true","bedroom_s":"1","image_src_s":"http://images.craigslist.org/00U0U_hclranU1O90_600x450.jpg","google_maps_link_s":"","subarea_s":"south bay","price_s":"$2859","sqft_s":"1023","postid_s":"5613180411","datetime_s":"2016-05-31 2:46pm 2016-05-31 2:46pm","bodytext_s":"Anton La Moraga - Sky Floorplan Amenities: Corian Stone Countertops Vinyl Plank Wood Flooring in living, dining, kitchen, and bathrooms Full Size Washer/Dryer (Electric) Stainless Steel Microwave Hood Dishwasher Disposal   Community Amenities: 24 Hour Emergency Maintenance Short Term Lease Available Elevator - Select buildings Clubhouse with contemporary kitchen and shuffle board Pet friendly community with pet stations Steps to Village Oaks Neighborhood Retail Center   Rent............. $2,859 a month Deposit........ $500 - $1,000 Bedrooms.... 1 bedrooms Bathrooms... 1.0 bathrooms Sq. Feet....... 1023 This Floorplan is available, please call us at show contact info Anton La Moraga Apartments is a 275 unit, multifamily rental project located on the Hitachi Campus in the heart of the Silicon Valley. Future residents of a Anton La Moraga Apartments are captivated by it's unique mission style and charm. From the beautifully landscaped courtyards, to the elaborate mission towers and grand arches, it is quite obvious that there was not a single detail overlooked. Those who will call Anton La Moraga home, enjoy the pleasures of a fully loaded, business and entertainment community center. This center features a full kitchen, icafe, media center, shuffleboard and two story gym. When it is time to enjoy a day of relaxation, residents can be found sitting poolside reading a book and barbecuing their favorite dish. Each unit includes expansive kitchens and living areas, personal patios, walk-in closets, and stainless steel appliances. The Village Oaks shopping center is just across the street and within walking distance where you can enjoy convenient grocery shopping and sitting down at one of the fantastic eateries. *Rent prices subject to change. One month free rent. Waived application fee. http://www.antonlamoraga.com/u/zrs7ume Please telephone us at: show contact info  Contemporary interiors with flat panel espresso cabinetry Townhome Floorplans - select units Walk In Closets Adjacent to Cottle Light Rail Station Corian Stone Countertops 24 Hour Emergency Maintenance Short Term Lease Available Full Size Washer/Dryer (Electric) Private Patio or Balcony Luxurious outdoor entertainment with grilling and dining areas Heat (Electric) Pet friendly community with pet stations Media Center Dishwasher Stainless Steel Microwave Hood Private attached and detached garages for lease Private attached garages (select floorplans) and detached garages for lease Stainless Steel Refrigerator with icemaker OnSite Management 24 hour 2 story fitness center with strength and cardio equipment, and cable TV the includes residents to full their quite is just Each is found center. Hitachi grocery be enjoy convenient living not distance Moraga located pleasures obvious you prices subject expansive beautifully This will poolside shuffleboard style towers Apartments From relaxation, enjoy unique features unit it's single there sitting of Those within areas, book kitchens","cats_s":"true","street_address_s":"","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613180411.html","category_s":"apts/housing for rent","bathroom_s":"1","available_s":"available jun 13","title_s":"? Live Like Royalty In Your New 1 Bdrm + Den!! ? 1 Month Free!!","neighborhood_s":"san jose south","dogs_s":"true","housetype_s":"apartment"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00P0P_dJaNFmyU5OL_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%34%31%37%37+Boneso+Cir+san+jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$3145","sqft_s":"1139","postid_s":"5572135535","datetime_s":"2016-05-05 12:53pm 2016-05-05 12:53pm 2016-05-31 2:48pm","bodytext_s":"Contact info: OneRent | show contact info Gorgeous 3 Bedroom Condo in Perfect Location 4177 Boneso Circle, San Jose, CA 95134 $3,145/mo KEY FEATURES Sq Footage: 1139 sqft. Bedrooms: 3 Beds Bathrooms: 2.5 Baths Parking: None Lease Duration: 1 Year Deposit: $3,145 Pets Policy: No Pets Allowed Laundry: In Unit Property Type: Condo DESCRIPTION Beautiful 3 Bed condo close Santa Row with many dining and shopping options, easy access to VTA, 237, 101, and 880. Open living space includes vaulted ceilings, natural light, private patio, and master bed/bath. This unit also comes with a gas fireplace, central heating and AC, and a washer and dryer in unit. 1 car garage parking included. The complex includes beautifully landscaped grounds with a shared pool and spa! Schedule a showing today before this rare find is taken! RENTAL FEATURES Range / Oven Refrigerator Dishwasher Garbage disposal Balcony, Deck, or Patio Heat: forced air Ceiling fans High-speed internet Hardwood floor Tile floor Fireplace Contact info: OneRent show contact info","street_address_s":"4177 Boneso Cir","page_url_s":"http://sfbay.craigslist.org/sby/apa/5572135535.html","category_s":"apts/housing for rent","bathroom_s":"2.5","parking_s":"true","available_s":"available may 05","title_s":"Gorgeous 3 Bedroom Condo in Perfect Location","neighborhood_s":"san jose","housetype_s":"condo"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00e0e_cqNNtw6L4ZC_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%32%36%30%31+Cortez+Dr+Unit+%31%32%30%35+santa+clara+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$2995","sqft_s":"974","postid_s":"5582799973","datetime_s":"2016-05-12 10:31am 2016-05-12 10:31am 2016-05-31 2:48pm","bodytext_s":"Contact info: OneRent | show contact info Updated 3 Bed Condo in Santa Clara 2601 Cortez Dr #1205, Santa Clara, CA 95051 $2,995/mo KEY FEATURES Sq Footage: 974 sqft. Bedrooms: 3 Beds Bathrooms: 2 Baths Parking: 2 Other Lease Duration: 1 Year Deposit: $2,995 Pets Policy: No Pets Allowed Laundry: In Unit Property Type: Condo DESCRIPTION Light and bright Top Floor Condo in the heart of Silicon Valley! The updated kitchen and baths have granite counter-tops, tile back-splashes, tile floors, and maple cabinetry! Some of the other touches include crown moldings, wall-to-wall carpeting, air conditioning, wall furnaces, in-unit laundry, ceiling fans, and 2 car-parking. Centrally located in Santa Clara, you are minutes away from HWY 101, the Lawrence CalTrain Station, and other public transportation. Also, you will be walking distance to Bracher Elementary school and Bracher Park, with walking paths, a grass field, BBQ, and a playground. There are plenty of restaurants, shopping, and retail around, and the newly being constructed Santa Clara Square, which is minutes away, will house a new Whole Foods Market along with new restaurants! This spectacular unit has so much to offer, come and see for yourself! You will not find a better value for a 3-bedroom in Santa Clara! Optionally furnished for an additional $150 per month RENTAL FEATURES Range / Oven Refrigerator Dishwasher Microwave Stainless steel appliances Heat: forced air Central A/C High-speed internet Tile floor Granite countertop COMMUNITY FEATURES Covered parking Contact info: OneRent show contact info","cats_s":"true","street_address_s":"2601 Cortez Dr Unit 1205","page_url_s":"http://sfbay.craigslist.org/sby/apa/5582799973.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available may 12","title_s":"Updated 3 Bed Condo in Santa Clara","neighborhood_s":"santa clara","dogs_s":"true","housetype_s":"condo"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00r0r_hlNg8pSmhcX_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%31%32%30%36+Weepinggate+Ln+san+jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$2850","sqft_s":"1296","postid_s":"5577728747","datetime_s":"2016-05-09 10:22am 2016-05-09 10:22am 2016-05-31 2:48pm","bodytext_s":"Contact info: OneRent | show contact info Fantastic 3 Bedroom Condo in Ideal Location. 1206 Weepinggate Ln, San Jose, CA 95136 $2,850/mo KEY FEATURES Sq Footage: 1296 sqft. Bedrooms: 3 Beds Bathrooms: 1.5 Baths Parking: None Lease Duration: 1 Year Deposit: $2,850 Pets Policy: Cats & Dogs OK Laundry: In Unit Property Type: Condo DESCRIPTION Fantastic condo situated in great Edenvale neighborhood. Featuring 3 huge bedrooms, 1.5 nice baths, and roughly about 1,296 square feet of living space. This classic beauty is both dazzling and inviting. Ideally suited for both entertaining and privacy. An elegant home offering luxurious comfort in every room. The open floor plan features spacious living, dining, and sun rooms. A tastefully updated kitchen featuring newer stainless steel appliances such as refrigerator, oven, dish washer, and trash compactor. This home also comes with a fenced yard and plenty of room to relax and enjoy family time. Some of the excellent amenities includes forced air, high speed internet and other utilities ready, in-unit laundry, plus a shared pool. Very convenient location. Close to everything. RENTAL FEATURES Range / Oven Refrigerator Dishwasher Garbage disposal Stainless steel appliances Fenced yard Heat: forced air High-speed internet Hardwood floor Fireplace Contact info: OneRent show contact info","cats_s":"true","street_address_s":"1206 Weepinggate Ln","page_url_s":"http://sfbay.craigslist.org/sby/apa/5577728747.html","category_s":"apts/housing for rent","bathroom_s":"1.5","parking_s":"true","available_s":"available may 09","title_s":"Fantastic 3 Bedroom Condo in Ideal Location.","neighborhood_s":"san jose","dogs_s":"true","housetype_s":"condo"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/01313_illTEqJEN1s_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+McKinley+Sunnyvale+CA+US","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$3500","sqft_s":"1610","postid_s":"5613178732","datetime_s":"2016-05-31 2:45pm 2016-05-31 2:45pm","bodytext_s":"Gorgeous super clean spacious 2 bedroom, 2.5 bath, 2 car attached garage, 1610 sq. ft, $3,500/month townhouse central silicon valley location close to downtown Sunnyvale Rental features: Size: 1610 sq. ft Bedrooms: 2 with master suites Bathrooms: 2 full baths and ? bath Parking: 2 car attached garage Laundry: Inside Floor: Three story Property type: Townhouse Home amenities: Private 2 car attached garage including storage room Kitchen with plenty of cabinet space, stainless kitchen appliances, granite counter tops, and breakfast bar Large inviting living room with built-in shelves, fireplace, and large balcony Large dining room with built-in shelves and balcony Lots of bedroom closet space, master bedroom with balcony, and storage space in garage Hardwood floors throughout and carpets in bedrooms Lots of natural light, large windows, and large patio doors Indoor washer and dryer; heating, air-conditioning, and cable access. Location: Central location in Silicon Valley Short walk to vibrant downtown Sunnyvale surrounded by great shopping and restaurants Short walk to Cal Train Easy access to 101, 237, 85, San Jose Airport, San Francisco Airport Close to Apple, LinkedIn, Google, Facebook, Amazon, Cisco, Intel, Yahoo, Microsoft, and others Highly rated Sunnyvale schools Quite, scenic, and peaceful neighborhood Leasing terms: Lease duration: 1 year Rent: $3,500 Renters Pay: Water, electricity, gas, garbage Deposit: $3,500 Available: June 4, 2016 Policy: No pets, no smoking, no section 8 Renter verification: Income, credit, previous rental, employment, background Please email landlord to answer questions and schedule viewing by appointment","street_address_s":"McKinley","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613178732.html","category_s":"apts/housing for rent","bathroom_s":"2.5","parking_s":"true","available_s":"available jun 04","title_s":"Gorgeous Sunnyvale Townhouse","neighborhood_s":"sunnyvale","housetype_s":"townhouse"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/00N0N_jMxAie86F07_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%37%33%37%35+Rollingdell+Dr+Cupertino+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$3195","sqft_s":"1016","postid_s":"5595722477","datetime_s":"2016-05-20 9:27am 2016-05-20 9:27am 2016-05-31 2:48pm","bodytext_s":"SIENA APARTMENTS IN BEAUTIFUL CUPERTINO We will have a gorgeous 2 bedroom 2 bathroom unit coming soon!! Siena promises a blissful and comfortable lifestyle from the inside, out. Our bright and spacious apartment homes offer newly RENOVATED interiors with cherry wood cabinetry, GRANITE countertops, newer appliances, generous storage, WASHER/DRYER in unit, and AIR CONDITIONING. Our beautifully manicured landscaping features a trellised garden courtyard, as well as picnic and barbeque areas. We have a large pool with jacuzzi spa, gym and resident computer room. The Cupertino Square Shopping Center, Stevens Creek Park and Trail, Apple Campus, DeAnza College, Hwy 280 and 85 are just minutes away! **********CUPERTINO SCHOOL DISTRICT************* Our friendly and attentive staff are waiting to welcome you home. Please stop by or call our office for an appointment today. Do not miss your chance to live in a beautiful area with award winning schools! Check out our Google and Apartment Rating Reviews! No pets (except service animals) Resident responsible for all utilities. Renters Insurance Is Required. Come by and take a tour today! 7375 Rollingdell Drive Cupertino, CA 95014 show contact info Website: siena.eprodesse dot com","street_address_s":"7375 Rollingdell Dr","page_url_s":"http://sfbay.craigslist.org/sby/apa/5595722477.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available may 25","title_s":"***Lovely*Huge*Two Bedroom*Two Bathroom*Coming Soon***","neighborhood_s":"cupertino","housetype_s":"apartment"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00303_kyxjMl45ew8_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%38%30%31+S+Monroe%2C+San+Jose+San+Jose+CA+US","smoking_s":"false","subarea_s":"south bay","price_s":"$3450","sqft_s":"1800","postid_s":"5613225170","datetime_s":"2016-05-31 3:13pm 2016-05-31 3:13pm 2016-05-31 3:16pm","bodytext_s":"Three bedroom house in a very nice neighborhood (West San Jose/ Campbell) Three bedroom house located in a very nice neighborhood available for rent (West San Jose/ Campbell) Available June 15th 3 bedrooms, one level house 2.5 baths 1818 sq ft on 7800 sq feet lot Spacious rooms Large kitchen with oak cabinets, dishwasher, garbage disposal Remodeled bathroom Wood burning Fireplace Central heating Window A/C, ceiling fans Large fenced backyard with fruit trees Excellent, convenient location, walking distance to Santana Row Close to highways 280 and 880/17 Campbell School District One year lease Clean credit, proof of income, and references required Sorry, no smokers and no pets Please email me with your contact information including your name, phone number and email address. Please describe yourself, how many people will be residing at the property, job information, and expected move-in date.","street_address_s":"801 S Monroe, San Jose","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613225170.html","category_s":"apts/housing for rent","bathroom_s":"2.5","available_s":"available jun 15","title_s":"3 Bed Room, 2.5 Bath house in a quiet area","neighborhood_s":"san jose west","housetype_s":"house"},
{"bedroom_s":"1","image_src_s":"http://images.craigslist.org/00a0a_k6CvIRMTdlH_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%39%30%30+Pepper+Tree+Lane+Santa+Clara+CA+US","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$2387","sqft_s":"700","postid_s":"5613190578","datetime_s":"2016-05-31 2:52pm 2016-05-31 2:52pm","bodytext_s":"Alderwood Apartments 900 Pepper Tree Lane Santa Clara, ca 95051 Property Website: http://www.prometheusreg.com/san-francisco-properties/alderwood  A1 ? 1  bed / 1 bath / 700 sq ft / $2,308 - $2,487 * Unit 1622 - Available Now * Unit 0128 - Available Now * Unit 1221 - Available 06/01/16 Make your next move to this spacious two bedroom apartment home with 1000 square feet of comfortable living space. This great place has many upgrades including a fully equipped kitchen, large closets, cable/internet connections, and much more. Contact our leasing office to schedule an appointment. Floor Plan/Unit Amenities: * Stainless steel appliances * Air Conditioning * Lake/Water View Property Amenities: * Swimming Pool and Spa * Clubhouse * Fitness Center Lease Terms: 1 Month- 12 Months Parking: Type - Covered Lot Additional spaces available to lease upon request. Pet Policy: Cats and Dogs are allowed. We champion an all-inclusive, Friends With Paws Program. No more weight limits, height restrictions or Best in Show hoops and hurdles. We'll greet your four-legged confidante as a distinguished guest with a Welcome Kit that includes tasty treats and toys to help your pal feel right at home. Our staff can even help the two of you find suitable pet grooming and daycare services when you need them. *For the pooches breed restrictions do apply. Two pet maximum per home. Office Hours: Monday:   9:00am to 6:00pm   Tuesday:   9:00am to 6:00pm   Wednesday:   9:00am to 6:00pm   Thursday:   9:00am to 6:00pm   Friday:   9:00am to 6:00pm   Saturday:   9:00am to 6:00pm   Sunday:   10:00am to 5:00pm   Management Company: Prometheus Real Estate Group, Inc.* Want more information? http://unit-availability.com/lead/4n04i7618686/1?extnId=5925065 Call Us Today! show contact info x394 Equal Housing Opportunity","cats_s":"true","street_address_s":"900 Pepper Tree Lane","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613190578.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available may 31","title_s":"Stunning Vaulted Ceilings with Plenty of Natural Sunlight Avail Now!","neighborhood_s":"santa clara","dogs_s":"true","housetype_s":"apartment"},
{"bedroom_s":"2","image_src_s":"","google_maps_link_s":"https://maps.google.com/maps/preview/@37.229600,-121.983400,16z","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$4214","sqft_s":"1011","postid_s":"5613190307","datetime_s":"2016-05-31 2:52pm 2016-05-31 2:52pm","bodytext_s":"Bay Tree http://lyonbaytree.prospectportal.com/su/cswh Bay Tree Apartment Community is tucked away in the foothills of the Santa Cruz Mountains, where you will enjoy the small town feel and the scenic views from our community. Our serene setting includes a resort-style swimming pool, covered parking and beautiful views. With Bay Tree's great location, just two blocks from Downtown Los Gatos shops, restaurants and cafes, you will enjoy all the treasures Los Gatos has to offer. Pet Friendly. Community Amenities Pet Friendly Laundry Care Center Resort-Style Pool Covered Parking Serene Creekside Setting with Mature Landscaping Near Los Gatos Creek and Trail Walking Distance to Downtown Los Gatos Shops, Restaurants and Cafes Los Gatos School District Convenient to Highways 17, 85 and 9 Contact Us Bay Tree Address:347 Massol Avenue, Los Gatos, CA 95030 Phone: show contact info Online:http://lyonbaytree.prospectportal.com/su/cswh Office Hours: Tue: 9:00am - 6:00pm Wed: 9:00am - 6:00pm Thu: 9:00am - 6:00pm Fri: 9:00am - 6:00pm Sat: 9:00am - 6:00pm Sun: 12:00pm - 5:00pm EQUAL HOUSING OPPORTUNITY Bay Tree, Laundry Care Center, Cat, Resort-Style Pool, Los Gatos School District, Walking Distance to Downtown Los Gatos Shops, Restaurants and Cafes, For rent, Pet Friendly, Convenient to Highways 17, 85 and 9, Dog, Near Los Gatos Creek and Trail","cats_s":"true","street_address_s":"","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613190307.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available may 31","title_s":"Great Special's On Two Bedroom's ! Up To $1000 Off 1st Month Call Now","neighborhood_s":"los gatos","dogs_s":"true","housetype_s":"apartment"},
{"bedroom_s":"2","image_src_s":"","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%33%34%37+Massol+Ave+Los+Gatos+CA+US","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$4214","sqft_s":"1011","postid_s":"5613189921","datetime_s":"2016-05-31 2:51pm 2016-05-31 2:51pm","bodytext_s":"Bay Tree http://lyonbaytree.prospectportal.com/su/5ljm The Bay Tree Apartment community of Los Gatos is tucked away in the foothills of the Santa Cruz Mountains. Enjoy the small town feel and the scenic views offered by Bay Tree. Just two blocks from Old Town, your apartment home will put you just a walk away from the areas best treasures. Community Amenities Pet Friendly Laundry Care Center Resort-Style Pool Covered Parking Serene Creekside Setting with Mature Landscaping Near Los Gatos Creek and Trail Walking Distance to Downtown Los Gatos Shops, Restaurants and Cafes Los Gatos School District Convenient to Highways 17, 85 and 9 Contact Us Bay Tree Address:347 Massol Avenue, Los Gatos, CA 95030 Phone: show contact info Online:http://lyonbaytree.prospectportal.com/su/5ljm Office Hours: Tue: 9:00am - 6:00pm Wed: 9:00am - 6:00pm Thu: 9:00am - 6:00pm Fri: 9:00am - 6:00pm Sat: 9:00am - 6:00pm Sun: 12:00pm - 5:00pm EQUAL HOUSING OPPORTUNITY Serene Creekside Setting with Mature Landscaping, Pet Friendly, Near Los Gatos Creek and Trail, Walking Distance to Downtown Los Gatos Shops, Restaurants and Cafes, For rent, Bay Tree, Convenient to Highways 17, 85 and 9, Laundry Care Center, Dog, Cat, Los Gatos School District","cats_s":"true","street_address_s":"347 Massol Ave","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613189921.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available may 31","title_s":"Beautifully Renovated 2 Bedroom Available Now In Downtown Los Gatos !","neighborhood_s":"campbell","dogs_s":"true","housetype_s":"apartment"},
{"bedroom_s":"1","image_src_s":"http://images.craigslist.org/00303_lI25d977WFC_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%38%31%37+N+%31%30th+St+at+Hedding+San+Jose+CA+US","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$2675","sqft_s":"733","postid_s":"5613176958","datetime_s":"2016-05-31 2:44pm 2016-05-31 2:44pm 2016-05-31 2:46pm","bodytext_s":"Marquis - A Brand New Community CALL US TODAY! show contact info x502 Want more information? http://unit-availability.com/lead/8f1052655976/1?extnId=5925010 1  bedroom 1 bath 733sqft $2,675/mo Welcome Home to Marquis - A Brand New Community. When you are in the market for your next home, check out this one-bedroom, one-bathroom apartment at Marquis! This floor plan features a well-equipped kitchen with stainless steel appliances, European-style cabinets, and quartz countertops. This particular model also features a washer and dryer, as well as ample storage space. You will love relaxing on the private balcony! Select homes in the community may also offer chef's islands, breakfast bars, or picture windows. As a resident, you'll gain access to a pool, a spa, and a gym. Japantown and local transit options are nearby, giving you access to plenty of shopping, dining, and entertainment. Your cats and dogs will be happy to live with you. This and much more await you! Call now! PROPERTY AMENITIES: * Dog Park & Wash * Swimming Pool & Spa * Library/Social Room * Bike Kitchen * BBQ Stations * Community Room * Rooftop Lounge * Z-Bar Lounge * Fitness Center * Bocce Court MANAGED BY: Woodmont Real Estate PROPERTY WEBSITE: http://www.liveatmarquis.com CALL US TODAY! show contact info x502 817 N 10th St San Jose, ca 95112 Equal Housing Opportunity","cats_s":"true","street_address_s":"817 N 10th St at Hedding","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613176958.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available may 31","title_s":"Summer Specials! 1 Month Free 1BR/1BA","neighborhood_s":"san jose downtown","dogs_s":"true","housetype_s":"apartment"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00p0p_c1jH5WOvVu2_600x450.jpg","google_maps_link_s":"","subarea_s":"south bay","laundry_s":"true","price_s":"$4200","sqft_s":"1141","postid_s":"5613187764","datetime_s":"2016-05-31 2:50pm 2016-05-31 2:50pm 2016-05-31 2:53pm","bodytext_s":"This is a Sunnyvale home in a quiet neighborhood near Ellis Elementary School. The 3rd bedroom is a separate cottage in the backyard, and there is a working jacuzzi in the backyard as well. Here are some details about the house: - 5610 sqft lot, 3 bed, 2 bath - Central heat and AC - Hot tub - Sprinkler System - Skylights - Separate cottage in backyard(about 240 sqft) - Attached garage with washer/drier - Gas stove with dual ovens - Hardwood floors Terms Rent: $4200/month Deposit: $4200 1 year lease Gardening Included Tenant pays all utilities No smoking Available in mid July!","cats_s":"true","street_address_s":"","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613187764.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available jul 18","title_s":"Beautiful Sunnyvale House For Rent","neighborhood_s":"sunnyvale","dogs_s":"true","housetype_s":"house"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/00H0H_7i6CBvAqe3n_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%31%37%33+Higdon+Ave+Mountain+View+CA+US","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$2750","sqft_s":"700","postid_s":"5613187574","datetime_s":"2016-05-31 2:50pm 2016-05-31 2:50pm","bodytext_s":"Fully Remodeled Mountain View Apartment, Minutes from Downtown! Property Address 173 Higdon Avenue, Unit 3 | Mountain View, CA 94041 Offered By GS Property Management, Inc.  |  show contact info Description Welcome to this fully remodeled top floor 2 bed 1.5 bath unit located less than 1 mile from Downtown Mountain View. This kitchen features all new stainless steel appliances, glass top range, refrigerator, dishwasher, granite counter tops, garbage disposal, sink/faucet and tile floors. The unit features a completely remodeled bathroom, new carpet throughout, new wall heaters, new toilets, new double pane windows, new closet doors, new front door, new window coverings, and one carport parking space. Coin-operated laundry facilities on site, and extra storage in carport. Conveniently located near shopping, restaurants, Downtown Mountain View, Shoreline Boulevard, El Camino Real, Central Expressway, highway 101, and 85. Property Listing **Please note: Golden State Property Management will never ask for funds prior to an application approval. We require that you view the property before submitting an application and will always have a manager meet at the property for showings. ***Appointments are not scheduled over email Please reference the property address when making an appointment show contact info *** Amenities Granite Counter Tops Stainless Steel Glass Top Range Stainless Steel Kitchenaid Refrigerator Stainless Steel Dishwasher New Tiled Floors in Kitchen and Bathroom New Carpet Throughout Double Pane Windows New Window Coverings Fresh Interior Paint New Toilets New Vanity in Bathroom New Tub New Shower Door New Tub Surround New Wall Heater New Closet Doors New Front Door Onsite Coin Operated Laundry One Carport Parking Space Tenants pay PG&E Details Beds/Baths: 2BD/1.0BA Square Feet: 700 Rental Terms Rent: $2,750.00 Application Fee: $35.00 Security Deposit: $2,750.00","street_address_s":"173 Higdon Ave","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613187574.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available may 31","title_s":"Fully Remodeled Mountain View Apartment, Minutes from Downtown!","neighborhood_s":"mountain view","housetype_s":"apartment"},
{"bedroom_s":"2","image_src_s":"","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%36%35%34%39+Crown+Blvd+San+Jose+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$3500","postid_s":"5613186022","datetime_s":"2016-05-31 2:49pm 2016-05-31 2:49pm","bodytext_s":"6549 Crown Blvd. San Jose CA Rent: $3500 Deposit: $3500 This 2 bedroom, 2 bath unit is located in a great location; near the Almaden Country Club. All electric kitchen with dishwasher. Detached 2 car garage with opener. Large living room. Recessed lighting, wood floors in living area, carpets in bedrooms. Separate family room with fireplace, and dining room. Inside laundry room with washer and dryer. Private yard with deck. Large bedrooms. Lots of closet/storage space. Approx. 1450 sq ft. No Pets Allowed. Please call show contact info to set up an appointment to view.","street_address_s":"6549 Crown Blvd","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613186022.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available jun 01","title_s":"Two Bedroom, Two Bath Unit with Garage","neighborhood_s":"san jose south","housetype_s":"apartment"},
{"bedroom_s":"3","image_src_s":"http://images.craigslist.org/00n0n_1xUY8bVioKV_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%31%30%35%38+Shamrock+Drive+Campbell+CA+US","subarea_s":"south bay","laundry_s":"true","price_s":"$4295","sqft_s":"1400","postid_s":"5613173865","datetime_s":"2016-05-31 2:42pm 2016-05-31 2:42pm","bodytext_s":"Remodeled single family home in Campbell that features to many upgrades to possibly mention. Over 1400 sq. feet of living space, huge back yard, updated kitchen with stainless steel appliances and granite counter tops, hardwood floors throughout, master suite, hot tub, separate garage, and the list goes on. - Nest-controlled Heating & Air Conditioning - Completely remodeled kitchen, with new appliances, heated floors, wine fridge, LED lighting, TV. - Double-pane windows - Detached drive-through garage with cabinets, workbench. - R/V hookup - Hot tub - Two large backyard patios - Garden area - Covered BBQ area - African walnut hardwood floors - Home has a lot of natural sunlight - Skylight in master bathroom - Sprinkler system - High-end ceiling speakers - HDMI cable hookups in living room and kitchen No Section 8 No Pets","street_address_s":"1058 Shamrock Drive","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613173865.html","category_s":"apts/housing for rent","bathroom_s":"2","parking_s":"true","available_s":"available jun 01","title_s":"Beautiful 3BR/2BA remodeled home in Campbell","neighborhood_s":"campbell","housetype_s":"house"},
{"bedroom_s":"2","image_src_s":"http://images.craigslist.org/00L0L_at2VFD83gbi_600x450.jpg","google_maps_link_s":"","subarea_s":"south bay","laundry_s":"true","price_s":"$3795","sqft_s":"945","postid_s":"5613185017","datetime_s":"2016-05-31 2:48pm 2016-05-31 2:48pm","bodytext_s":"Welcome to the Glenbrook Apartments! Luxury is yours in this two-bedroom, one-bathroom apartment at Cupertino's best address. Glenbrook Apartments has a beautiful thirty-acre community with seven swimming pools, sports courts, and lush gardens. Nestled in the rolling lawns is your very own apartment, a spacious home with in home washer/dryer, honey maple wood flooring, full-wall closets, ceiling fans, and dual-pane windows. The kitchen if fully equipped with a dishwasher, microwave, and refrigerator. Granite makes for stylish counters in the kitchen and bathroom too. Stay comfy throughout the year with decorator ceiling fans and a programmable thermostat. Should you need to venture beyond the community, Glenbrook Apartments are in close proximity to major highways and a twenty-eight-acre memorial park. The Oaks Shopping Center, De Anza College, and the Apple campus are also a short drive away. Visit today to find the luxury of living at Glenbrook Apartments! CALL US TODAY! show contact info PROPERTY AMENITIES: * Creekside Hub Co-work Space * The Meadow, an all-weather playfield * Tennis Courts * Indoor Driving Range * Sand volleyball court * Guest Parking * Pilates & Yoga studio * State-of-the-Art Fitness Center * Bike lockers available * Billiards room * Two relaxing spas and saunas * On-site Management * 24-hour emergency on-call maintenance * Near Public Transit * Nine-hole putting green * Coffee Xpress with Free Starbucks Coffee * Online resident portal for rent payments and maintenance requests 10100 Mary Avenue Cupertino, CA 95014 show contact info","street_address_s":"","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613185017.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available jul 04","title_s":"2 bedroom/1 bath, Cupertino school district, W/D in unit, Call Today","neighborhood_s":"cupertino","housetype_s":"apartment"},
{"bedroom_s":"1","image_src_s":"http://images.craigslist.org/00404_8rDB4bPRVXx_600x450.jpg","google_maps_link_s":"https://maps.google.com/?q=loc%3A+%35%30%32+Mansion+Park+Dr+Santa+Clara+CA+US","smoking_s":"false","subarea_s":"south bay","laundry_s":"true","price_s":"$2863","sqft_s":"866","postid_s":"5613184227","datetime_s":"2016-05-31 2:48pm 2016-05-31 2:48pm","bodytext_s":"Every day extraordinary--Mansion Grove is a stately luxury retreat in Santa Clara. Style 03 ? 1  bed / 1 bath / 866 sq ft / $2,863 - $6,699 * Unit 305 - Available Now * Unit 401 - Available Now * Unit 301 - Available Now Mansion Grove 502 Mansion Park Dr Santa Clara, CA 95054 Property Website: http://www.prometheusreg.com/san-francisco-properties/mansion-grove Want more information? http://unit-availability.com/lead/201532902049/1?extnId=5925016 Call Us Today! show contact info x834 Property Description This one-bedroom, one-bathroom apartment at Mansion Grove has a huge den that you can use as a guest room or library. GE stainless steel appliances such as over-the-range microwave and electric stove are part of the kitchen features. This apartment has abundant storage space, including a walk-in closet in the bedroom and a storeroom next to the balcony. A GE washer and dryer in this home offer a convenient way to do laundry. Mansion Grove welcomes those with pets, and the neighborhood is a non-smoking environment. Wi-Fi is offered in all of the common areas, including the business center. Neighbors can exercise in the fitness center, go for a swim in one of the two large pools, or simply relax and enjoy a movie with friends in the luxurious cinema lounge. Mansion Grove is conveniently close to Rivermark Shopping Center and Levi's Stadium. Call now to learn more. Property Amenities * Enjoy elegant waterscapes and lush gardens * Fireside lounge w/baby grand piano and large screen TV * Never far from facebook. * Fitness center * Pool * Cabana* Lease Terms: 1-12 months Parking: Type - Multiple Garage, carports, open unassigned parking and additional garage parking spaces are available to rent. Pet Policy: Cats and Dogs are allowed. We champion an all-inclusive, Friends With Paws Program. No more weight limits, height restrictions or Best in Show hoops and hurdles. We'll greet your four-legged confidante as a distinguished guest with a Welcome Kit that includes tasty treats and toys to help your pal feel right at home. Our staff can even help the two of you find suitable pet grooming and daycare services when you need them. *For the pooches breed restrictions do apply. Two pet maximum per home. Building Type: Mid Rise Remodeled: 2010 Units: 1000 Office Hours Monday:   9:00am to 6:00pm    Tuesday:   9:00am to 6:00pm    Wednesday:   9:00am to 6:00pm    Thursday:   9:00am to 6:00pm    Friday:   9:00am to 6:00pm    Saturday:   9:00am to 6:00pm    Sunday:   9:00am to 6:00pm    Management Company: Prometheus Real Estate Group, Inc.* Call Us Today! show contact info x834 Equal Housing Opportunity","cats_s":"true","street_address_s":"502 Mansion Park Dr","page_url_s":"http://sfbay.craigslist.org/sby/apa/5613184227.html","category_s":"apts/housing for rent","bathroom_s":"1","parking_s":"true","available_s":"available may 31","title_s":"A Non-Smoking 1BR/1BA Apartment with a Huge Den & an Extra Storage Are","neighborhood_s":"santa clara","dogs_s":"true","housetype_s":"apartment"}]